{
    "Greetings": {
        "patterns": [
            "Hello",
            "Hi",
            "Heya",
            "Yo",
            "Hey love",
            "What's up",
            "You alright?",
            "Good morning",
            "Good afternoon",
            "Good evening",
            "Hiya",
            "Howdy",
            "Hi there",
            "Hi mate",
            "How are you doing",
            "How's it going",
            "What's good",
            "How's things",
            "Aloha",
            "What's happening",
            "Hiya mate",
            "Salutations",
            "Hola",
            "Bonjour",
            "How far",
            "Ciao",
            "Halo",
            "Xin chao",
            "Namaste"
        ],
        "responses": [
            "Hello! Welcome to Adidas customer support. How can I assist you today?",
            "Hey there! Thanks for reaching out to Adidas customer support. How can I help you?",
            "Aloha! I'm here to help you with any questions you have about Adidas products or services",
            "Hiya! You've reached Adidas customer support. How can I assist you today?",
            "Howdy! Welcome to Adidas customer support. How can I help make your experience better?",
            "Hola! You're now connected to Adidas customer support. How can I assist you today?"
        ]
    },
    "Goodbye": {
        "patterns": [
            "Goodbye",
            "Bye",
            "See you later",
            "Farewell",
            "Take care",
            "Have a good one",
            "Catch you later",
            "Until we meet again",
            "Adios",
            "So long",
            "Bye-bye",
            "Cheerio",
            "Sayonara",
            "Peace out",
            "Later gator",
            "Take it easy",
            "See you soon"
        ],
        "responses": [
            "Goodbye! If you have any more questions in the future, don't hesitate to reach out. Have a great day.!",
            "Alright, goodbye! Feel free to come back anytime you need assistance. Take care.!",
            "Okay, goodbye! Remember, we're here to support you whenever you need us. Have a fantastic day.!",
            "Bye for now! If you ever have questions or need help with anything Adidas-related, don't hesitate to contact us again.",
            "Alright, goodbye! Have a great day ahead, and remember, we're just a message away if you need assistance in the future.",
            "Goodbye! Thanks for chatting with us. If you have any more questions or need assistance, don't hesitate to reach out."
        ]
    },
    "Thanks": {
        "patterns": [
            "Thank you",
            "Appreciate it",
            "Thanks a lot",
            "Thank you so much",
            "Thanks for your help",
            "I appreciate your assistance",
            "Many thanks",
            "Thank you very much",
            "Much appreciated",
            "Thanks for the support",
            "Thanks for your time",
            "Grateful for your help",
            "I'm thankful for your assistance",
            "Thanks for being so helpful",
            "I'm grateful for your support"
        ],
        "responses": [
            "You're welcome! If you have any more questions or need further assistance, feel free to reach out.",
            "No problem at all! If there's anything else you need help with, just let me know",
            "Anytime! If you have any more questions or need assistance, I'm here to help.",
            "You're welcome! If there's anything else I can do for you, just give me a shout.",
            "Happy to help! If you ever need assistance again, don't hesitate to contact Adidas customer support."
        ]
    },
    "Payment Methods": {
        "patterns": [
            "How can I pay",
            "How do I make a payment",
            "What payment methods are available",
            "What can I use to pay for my order",
            "Options for payments",
            "What payment options do you support",
            "What are the ways I can pay for my order",
            "What forms of payment do you accept online",
            "How should I go about paying for my purchase?",
            "Can you tell me about the payment process?",
            "Are there different payment methods I can choose from?",
            "Do you accept multiple forms of payment?"
        ],
        "responses": [
            "Making payments is easy with our multiple payment options. You can use any major credit or debit card, including Visa, Mastercard, American Express, and Discover. We also support PayPal payments for secure transactions",
            "When it comes to payment, we've got you covered with various options. You can pay using major credit cards like Visa, Mastercard, American Express, and Discover. Additionally, PayPal is available for seamless transactions",
            "To complete your purchase, you can choose from a variety of payment methods. We accept major credit cards such as Visa, Mastercard, American Express, and Discover, as well as PayPal for your convenience",
            "You can pay for your order using Visa, Mastercard, American Express, Discover, or PayPal. Our checkout process is designed to make payment easy and secure.",
            "You have several payment methods available when shopping with us, including credit/debit cards and PayPal. Rest assured, we provide a secure payment process for your convenience.",
            "You have the flexibility to pay for your order using credit/debit cards (Visa, Mastercard, American Express, Discover) or PayPal. Choose the method that suits you best during checkout."
        ]
    },
    "Debit cards": {
        "patterns": [
            "Which debit cards are accepted?",
            "Do you accept debit cards for payment?",
            "Can I use my debit card to pay?",
            "Are there specific debit cards you accept?",
            "What types of debit cards can I use?",
            "Do you support payments with debit cards?Are Visa debit cards accepted?",
            "Can I pay with my Mastercard debit card?",
            "Do you accept American Express debit cards?",
            "What about Discover debit cards?",
            "Do you accept Visa debit cards?"
        ],
        "responses": [
            "We accept most major debit cards, including Visa, Mastercard, American Express, and Discover. You can use any of these cards to make a payment.",
            "You can pay using a variety of debit cards, including Visa, Mastercard, American Express, and Discover. We aim to make the payment process convenient for you.",
            "We support payments with Visa, Mastercard, American Express, and Discover debit cards. You can confidently use any of these cards for your transaction.",
            "We accept a variety of debit cards, including Visa, Mastercard, American Express, and Discover. Feel free to use any of these cards for your payment."
        ]
    },
    "Credit cards": {
        "patterns": [
            "Which credit cards are accepted?",
            "Do you accept credit cards for payment?",
            "Can I use my credit card to pay?",
            "Are there specific credit cards you accept?",
            "What types of credit cards can I use?",
            "Do you support payments with credit cards?Are Visa credit cards accepted?",
            "Can I pay with my Mastercard credit card?",
            "Do you accept American Express credit cards?",
            "What about Discover credit cards?",
            "Do you accept Visa credit cards?"
        ],
        "responses": [
            "We accept most major credit cards, including Visa, Mastercard, American Express, and Discover. You can use any of these cards to make a payment.",
            "You can pay using a variety of credit cards, including Visa, Mastercard, American Express, and Discover. We aim to make the payment process convenient for you.",
            "We support payments with Visa, Mastercard, American Express, and Discover credit cards. You can confidently use any of these cards for your transaction.",
            "We accept a variety of credit cards, including Visa, Mastercard, American Express, and Discover. Feel free to use any of these cards for your payment."
        ]
    },
    "PayPal": {
        "patterns": [
            "Can I use PayPal to pay for my order?",
            "Do you accept PayPal payments?",
            "Can I pay with PayPal?",
            "What about PayPal, is it an option?",
            "Is PayPal accepted as a payment method?",
            "How do I use PayPal for payment?",
            "Can I link my PayPal account for payment?",
            "Do you support payments through PayPal?",
            "Are PayPal transactions available?",
            "Can I pay using my PayPal account?",
            ""
        ],
        "responses": [
            "Absolutely! We do accept PayPal as a payment method. You can securely complete your purchase using your PayPal account.",
            "Yes, we do support payments through PayPal. You can easily make your payment using your PayPal account.Yes, we do support payments through PayPal. You can easily make your payment using your PayPal account.",
            "Yes, PayPal is an option for payment. You can select the PayPal option at checkout for a seamless transaction.",
            "Indeed, PayPal transactions are available as a payment option. It's a convenient and secure way to pay for your order."
        ]
    },
    "Unsupported Payment Methods": {
        "patterns": [
            "Can I pay with Apple Pay?",
            "Do you support Google Pay payments?",
            "Are payments via Venmo accepted?",
            "Can I use Afterpay for payment?",
            "Is payment with Klarna available?",
            "Do you accept payments through Amazon Pay?",
            "Can I pay using a cryptocurrency like Bitcoin?",
            "Are payments via Alipay accepted?",
            "Do you support WeChat Pay transactions?",
            "Can I pay with a prepaid gift card?"
        ],
        "responses": [
            "Currently, we accept payments via major credit/debit cards and PayPal. We don't support Apple Pay, Google Pay, Venmo, Afterpay, Klarna, Amazon Pay, cryptocurrency payments, Alipay, WeChat Pay, or prepaid gift cards.",
            "We accept payments through major credit cards and PayPal. Unfortunately, we don't currently support Apple Pay, Google Pay, Venmo, Afterpay, Klarna, Amazon Pay, cryptocurrency payments, Alipay, WeChat Pay, or prepaid gift cards.",
            "We currently accept payments via major credit cards and PayPal only. We don't support Apple Pay, Google Pay, Venmo, Afterpay, Klarna, Amazon Pay, cryptocurrency payments, Alipay, WeChat Pay, or prepaid gift cards."
        ]
    },
    "Payment Issues": {
        "patterns": [
            "I'm having trouble completing my payment",
            "My payment isn't going through",
            "There seems to be an issue with my payment",
            "I received an error message during the payment process",
            "I'm experiencing difficulties with my payment",
            "There's a problem with my credit card payment",
            "I'm encountering an issue with PayPal payment",
            "Can you help me with a payment problem?",
            "I'm facing issues with the payment pagePayment problem",
            "I cannot pay",
            "Payment issue",
            ""
        ],
        "responses": [
            "I apologize for the inconvenience. Please double-check the information entered and ensure it matches the details on your card. If the issue persists, you may want to try a different payment method or contact your bank for assistance",
            "I'm sorry to hear that you're experiencing difficulties with your payment. Please make sure that your payment information is accurate and up to date. If the issue persists, feel free to reach out to our support team for further assistance.I'm sorry to hear about the error message you encountered. Please try refreshing the page and attempting the payment again. If the problem persists, please reach out to our live chat agents with details of the error message so we can further investigate.I'm sorry to hear that you're having trouble with the payment page. Please try accessing the page from a different device or network to see if the issue persists. If you're still unable to proceed, please let us know so we can investigate further."
        ]
    },
    "Payment Decline": {
        "patterns": [
            "My payment was declined, but I'm not sure why",
            "My payment was declined",
            "Why was my payment declined?",
            "There's a problem with my card",
            " it keeps getting declined",
            "My credit card payment was declined",
            "The payment didn't go through",
            " it was declined",
            "I'm seeing a message saying my payment was declined",
            "What should I do if my payment is declined?",
            "Can you help with a declined payment issue?",
            "My debit card payment got declined",
            "Why is my payment being declined repeatedly?"
        ],
        "responses": [
            "I'm sorry to hear that your payment was declined. This could happen for various reasons, including insufficient funds, security measures, or an issue with your card. Please double-check your payment information and ensure there are sufficient funds available. If the problem persists, you may want to contact your bank or card issuer for further assistance.",
            "I apologize for the inconvenience caused by the payment decline. Payment declines can occur due to reasons such as insufficient funds, incorrect card details, or security measures. Please double-check your payment information and try again. If the issue persists, you may want to contact your bank or card issuer for assistance.I'm sorry to hear that you're seeing a message stating your payment was declined. Please verify that the card details entered are correct and that there are sufficient funds available in your account. If the issue persists, you may need to contact your bank or card issuer for further assistance."
        ]
    },
    "Payment Confirmation": {
        "patterns": [
            "Can I get confirmation that my payment went through?",
            "How do I know if my payment was successful?",
            "I just made a payment",
            " can I receive confirmation?",
            "Is there a way to confirm my payment?",
            "Can you confirm that my payment was received?",
            "How long does it take to receive payment confirmation?",
            "Will I get a confirmation email after making a payment?",
            "What should I expect after making a payment for my order?",
            "How can I check the status of my payment?",
            "Can I receive a receipt or confirmation number for my payment?"
        ],
        "responses": [
            "Once your payment is successfully processed, you will receive a confirmation email with details of your order. Please allow some time for the confirmation email to arrive, and feel free to reach out if you have any further questions.",
            "After making a payment, you should receive a confirmation email shortly with all the details of your order. If you haven't received it yet, please check your spam or junk folder, as it may have been filtered there. If you still can't find it, feel free to contact us for assistance.",
            "You will receive a payment confirmation email once your payment is successfully processed. This email will contain all the details of your order, including the items purchased and payment information. If you haven't received the confirmation email within a reasonable time, please let us know.",
            "Upon successful payment processing, you will receive a confirmation email containing all the details of your order. This email serves as your receipt. If you haven't received the confirmation email within a reasonable time, please reach out to us, and we'll be happy to assist you."
        ]
    },
    "Contact Customer Service": {
        "patterns": [
            "How can I contact customer service?",
            " Can I speak to someone in customer service?",
            " I need to talk to customer support",
            " What's the best way to get in touch with customer service?",
            " Is it possible to talk to a customer service representative?",
            " I want to have a conversation with customer support",
            "Help me",
            "I need help",
            "I need assistance",
            "Can I speak with a representative",
            "How can I get in touch with customer service",
            "Talk with customer support",
            "Need customer support help",
            "Can I contact you via email",
            "Contact email",
            "Contact phone number",
            "What phone number can I reach you on",
            "What's your email address",
            "Tell me how to contact adidas",
            ""
        ],
        "responses": [
            "I'm here to help. What seems to be the issue? You can also contact our customer support team directly via phone at 020 7365 7315 or email at customercareuk@adidas.com",
            "Feel free to share your concerns or questions. If you prefer to speak with someone directly, you can contact our customer support team via phone at 020 7365 7315 or email at customercareuk@adidas.com",
            "I'm here to assist you with any questions or problems you may have. If you'd like to reach out to our customer support team directly, you can do so by calling 020 7365 7315 or emailing customercareuk@adidas.com",
            "I'm here for you. If you'd like to connect with our customer support team directly, you can reach them at 020 7365 7315 or email them at customercareuk@adidas.com."
        ]
    },
    "Contact Human Agent": {
        "patterns": [
            "Can I talk to a human agent?",
            "I want to speak with a real person.",
            "Can you connect me to an agent?",
            "Is it possible to speak with a live agent?",
            "Can you put me through to a human agent?",
            "I'd like to talk to a human representative",
            "I prefer to speak with someone in person",
            "Can you transfer me to an agent",
            "Please connect me to a human representative",
            "Talk to a real person",
            "Connect me to a live agent",
            "Live chat",
            "I want live chat",
            "Speak with an agent"
        ],
        "responses": [
            "I'm sorry I couldn't resolve your issue. You can get in touch with a live representative for personalized assistance by clicking here",
            "Unfortunately, I wasn't able to help with your request. For immediate assistance from one of our live agents, please click here",
            "I'm sorry that I couldn't provide the assistance you needed. For personalized support from one of our live agents, please click here to start a live chat session",
            "I apologize for any inconvenience. If you need further assistance, you can speak with a live representative using our live chat option here."
        ]
    },
    "Check Invoice": {
        "patterns": [
            "I need a copy of my invoice, please",
            "Could you assist me in obtaining a copy of my invoice",
            "How can I get a copy of my invoice",
            "I'm looking to get a copy of my invoice, can you help",
            "Is it possible to receive a copy of my invoice",
            "Where can I find my invoice",
            "Download my invoice",
            "Please send me my invoice.",
            "Can you provide me with the invoice for my recent purchase",
            "I'd like to request a copy of my invoice, please",
            "Do you have a way for me to access my invoice",
            "Send invoice",
            "I want an invoice",
            "See my a copy of my invoice"
        ],
        "responses": [
            "We will email you a PDF copy of your invoice. You should receive it shortly after you get your shipment confirmation email",
            "Certainly, we'll send you a PDF copy of your invoice via email. Look out for it in your inbox, typically after you receive your shipment confirmation.",
            "We'll email you a PDF copy of your invoice. You should expect to receive it shortly after your shipment confirmation email."
        ]
    },
    "Check Receipt": {
        "patterns": [
            "Can you help me check my receipt",
            "I need assistance in reviewing my receipt, please",
            "How can I verify my receipt",
            "Could you check my receipt for me",
            "Is there a way to confirm my receipt",
            "I'm looking to review my receipt, can you assist",
            "Can you provide guidance on how to check my receipt",
            "Where can I go to verify my receipt",
            "I'd like to confirm the details on my receipt, please help",
            "Do you have a service for checking receiptsCheck my receipt",
            "Where's my receipt",
            "Want to see my receipt",
            "Evidence of my payment"
        ],
        "responses": [
            "We will email you a PDF copy of your receipt. You should receive it shortly after you get your shipment confirmation email",
            "Certainly, we'll send you a PDF copy of your receipt via email. Look out for it in your inbox, typically after you receive your shipment confirmation.",
            "We'll email you a PDF copy of your receipt. You should expect to receive it shortly after your shipment confirmation email."
        ]
    },
    "Payment Method Remove": {
        "patterns": [
            "Remove payment method",
            "Delete payment method",
            "Remove card details",
            "Delete card details",
            "Remove payment details",
            "How can I delete a payment method from my account",
            "Is there a way to remove a payment method from my profile",
            "Could you assist me in removing a payment method from my account",
            "I need help removing a payment method from my account, can you guide me",
            "Can you provide instructions on how to delete a payment method",
            "I'm looking to remove a payment method from my profile, is that possible",
            "Is there a process for removing a payment method from my account",
            "Could you help me with removing a saved payment method",
            "Can you show me how to remove a payment method from my account settings",
            "I'd like to remove a payment method from my account, can you help me do that",
            ""
        ],
        "responses": [
            "Easy! To remove a payment method, log in to your account and navigate to the payment settings. From there, select the payment method you want to remove and choose the option to delete it. For more assistance, contact us by phone or WhatsApp at 020 7365 7315",
            "Simply log in to your account, head to the payment settings, locate the payment method you wish to remove, and select the delete option. Need further assistance? Reach out to us via phone or WhatsApp at 020 7365 7315",
            "Piece of cake! Removing a payment method is simple. Log in to your account, navigate to payment settings, select the payment method you'd like to remove, and hit delete. For any additional support, reach out to us on phone or WhatsApp at 020 7365 7315."
        ]
    },
    "Payment Refunds": {
        "patterns": [
            "How do I request a refund?",
            "Can I get a refund for my purchase?",
            "I'd like to request a refund, please.",
            "What's the process for asking for a refund?",
            "Process for getting a refund",
            "Can you tell me how to apply for a refund?",
            "How can I initiate a refund?",
            "Is it possible to get a refund for my order?",
            "Am I eligible for a refund on my purchase?",
            "I want to ask for a refund, please.",
            "Can I request a refund for my order?",
            "Please help me request a refund.",
            "I want a refund",
            "Give me back my money",
            "Return my money",
            "Send my money",
            "Where's my money",
            "I'm seeking a refund for my purchase",
            "Arrange a refund for me, please",
            "I want my money back",
            "I'd like to be refunded",
            "Can you send my money back?",
            "Where's my refund?",
            "Can I get a reimbursement?",
            "How long will it take you to process my refundHow long should I wait to receive my refund"
        ],
        "responses": [
            "Once your return arrives at one of our warehouses and the quality has been approved, we’ll initiate your refund within 14 business days. Click here for more information about our refund policy. If you require further assistance, please contact live chat.",
            "Once your returned item reaches our warehouse and passes inspection, we'll begin processing your refund within 14 business days. For more details on our refund policy, click here. If you need additional assistance, don't hesitate to reach out via live chat",
            "After your returned product is received and approved at our facility, we'll initiate your refund within 14 business days. For detailed insights into our refund policy, please visit this page. Should you require further support, our live chat is available to assist you",
            "Once your return is received and verified for quality, we'll promptly begin processing your refund within 14 business days. To learn more about our refund policy, click here. If you need any further assistance, our live chat team is ready to help."
        ]
    },
    "Payment Authorization Holds": {
        "patterns": [
            "Why is there a hold on my payment?",
            "What is the reason for the hold on my payment?",
            "Can you tell me why my payment is being held?",
            "What is causing the hold on my payment?",
            "Why has my payment been placed on hold?",
            "Hold on my payment",
            "Payment is not going through",
            "What's the hold-up with my payment?Seems my payment is blocked."
        ],
        "responses": [
            "A hold may have been placed on your payment as part of our standard security measures to ensure the validity of transactions. Rest assured, it's a temporary measure and will be released once the transaction is processed",
            "The hold on your payment could be due to various reasons, such as security checks or verification procedures. We apologize for any inconvenience caused and assure you that we're working to resolve it as quickly as possible.",
            "The hold on your payment is likely due to our system's routine security checks. This is to protect both you and us from any potential fraudulent activity. We appreciate your patience as we work to resolve this issue."
        ]
    },
    "Payment Security Measures": {
        "patterns": [
            "Are my payments secure?",
            "Is it safe to provide my card details?",
            "Can I trust that my payments are safe",
            "Are my card details protected",
            "Can I rely on the security of my payment information",
            "How secure are my payments",
            "Are my card details kept safe",
            "Can I be confident in the safety of my payment transactions",
            "Is there assurance that my card details are secure",
            "Are my payments and card information safeguarded",
            "What actions are taken to protect my payments",
            "What security measures are in place for my payments",
            "How do you protect my payment information",
            "What steps do you take to ensure my payments are secure",
            "Are my payments safe",
            "Hope my card details are safe",
            "Are my card details secure"
        ],
        "responses": [
            "We prioritize the security of your payments. We employ industry-standard encryption and security protocols to safeguard your card details.",
            "Your payments are safe with us. We have implemented stringent security measures to protect your card details and ensure secure transactions.",
            "You can trust that your payments are secure with us. We have implemented multiple layers of security to safeguard your card details and ensure safe transactions."
        ]
    },
    "Payment Installment Refunds": {
        "patterns": [
            "How do I request a refund on my installment payments?",
            "Can I get a refund for the installments I've already paid?",
            "I'd like to request a refund for my installment payments.",
            "Is it possible to get a refund for the installments I've paid so far?",
            "Can I receive a refund for the payments I've made in installments?",
            "What's the process for getting a refund on my installment payments?",
            "How can I ask for a refund on the payments I've made in installments?",
            "Can you tell me how to request a refund on my installment payments?",
            "I'd like to ask for a refund on my installment payments.",
            "Can I request a refund for the installment payments I've made?",
            "I want to request a refund for the payments I've made in installments.",
            ""
        ],
        "responses": [
            "We understand, and refunds for installment payments are available. Kindly reach out to our customer service team with your transaction ID and installment plan details to initiate the refund process.",
            "Initiating a refund for your installment payments is simple. Just visit our website and fill out the refund form with the necessary information. Our team will process your request promptly",
            "Refunds for installment payments are part of our service. Please contact our customer service team and provide them with your transaction ID and installment plan details to proceed with the refund."
        ]
    },
    "Payment Dispute Resolution": {
        "patterns": [
            "How do I dispute a payment?",
            "I need help resolving a payment dispute.",
            "What steps should I take to dispute a charge?",
            "Can you assist me with a payment dispute?",
            "I have a problem with a transaction, how can I resolve it?",
            "Who should I contact to dispute a payment?",
            "Is there a process for disputing payments?",
            "What's the procedure for resolving payment disputes?",
            "I disagree with a charge on my account, what should I do?",
            "How can I challenge a payment?"
        ],
        "responses": [
            "Contact us by phone at 020 7365 7315 and provide us with details such as the transaction ID and the reason for the dispute. Our team will investigate and assist you further.",
            "If you need help with your dispute, don't hesitate to call us at 020 7365 7315. Share the transaction ID and reason for dispute, and we'll investigate to provide further assistance."
        ]
    },
    "Payment Installment": {
        "patterns": [
            "Can I pay in installments?Is it possible to make payments in installments",
            "Do you offer installment payment options",
            "Can I split my payment into installments",
            "Are there installment plans available for payment",
            "Do you support paying in monthly installments",
            "Is there a way to pay for this in multiple installments",
            "Can payments be spread out over several installments",
            "Do you allow customers to pay in installment payments",
            "Is there an option for paying in installments?",
            "Can I opt for an installment payment plan?"
        ],
        "responses": [
            "We offer installment payments using Klarna! When you purchase Adidas items with Klarna, you can pay in three separate installments. The first installment is taken when your order is confirmed",
            "Adidas offers installment payments through Klarna. When you choose Klarna at checkout, you can divide your payment into three convenient installments, with the first one due at the time of purchase",
            "Adidas supports installment payments with Klarna. When you shop with us and choose Klarna at checkout, you can split your payment into three equal installments, with the initial payment made upon order confirmation."
        ]
    },
    "Order Status": {
        "patterns": [
            "Where is my order",
            "Status of my order",
            "Update on my order",
            "Check my order status",
            "Order status update",
            "Order update",
            "Order status check",
            "Where's my order",
            "I'm curious about the status of my order",
            "How can I check the status of my order?",
            "What stage is my order currently in?",
            "Can you tell me the status of my recent order?",
            "Where can I see the progress of my order?",
            ""
        ],
        "responses": [
            "Visit your order details page to track the status of a recent order. If it hasn’t been shipped yet, we are doing everything to send your order asap. If you’ve received your shipping email with a Royal Mail track and trace number, please use the tracking link within the email to get the latest information regarding your delivery.",
            "To track the status of your recent order, simply visit your order details page. If your order hasn't been shipped yet, rest assured we're working diligently to dispatch it as soon as possible. Once you receive your shipping confirmation email containing a Royal Mail track and trace number, utilize the tracking link provided to access the latest updates on your delivery."
        ]
    },
    "Find Order Number": {
        "patterns": [
            "What's my order number",
            "Find my order ID",
            "I don't know my transaction ID",
            "Can you provide my order number",
            "Retrieve my order ID, please",
            "I'm unsure of my transaction ID.Could you find my order number",
            "I need help locating my order ID",
            "I don't have my transaction ID",
            "What's the status of my order without the order number",
            "I can't find my order ID",
            "Help me find my order number",
            "Locate my transaction ID, please",
            "I forgot my order numberRemind me my transaction ID"
        ],
        "responses": [
            "You can find your order number in your order history or in the email we sent you to confirm the order.",
            "Check your email inbox for the order confirmation message",
            " your order number should be included there.",
            "Check the email you received confirming your order",
            " your order number should be included there.",
            "To locate your order number, check the email we sent you confirming your purchase",
            " it should be there."
        ]
    },
    "Place Order": {
        "patterns": [
            "Make order",
            "I want to buy some items",
            "Please, how can I buy some items",
            "I want to buy trainers",
            "Purchase sneakers",
            "Buy sneakers",
            "Purchase tracksuits",
            "I want to buy pants",
            "I want to make a new order.",
            "How can I place an order?",
            "I'd like to buy some items.",
            "How do I start the ordering process?",
            "Can I place an order on your website?",
            "Where can I go to make a purchase?",
            "How do I add items to my cart?",
            "Is there a way to buy products from Adidas?",
            "How can I shop for Adidas products?",
            "I'm interested in making a purchase.",
            "Could you help me buy a few of your items",
            "I do not know how I could buy some items",
            "I don't know how to buy several of your items",
            "I have to buy several items",
            "I need help to buy several items",
            "I do not know what to do to buy several items",
            "I don't know how I could buy an item",
            "I try to buy several items",
            "could you help me buy something?",
            "would it be possible to buy several items?",
            "where do I buy a few of your items?",
            "could you help me to buy several of your items?",
            "assistance making an order",
            "help buying some of your items",
            "I don't know how to make an order",
            "how could I buy an item?",
            "help me buy a few of your item",
            "I don't know how I could make an order",
            "I need assistance buying an item",
            "help me buy several items",
            "I need help making an order",
            "how to buy something?",
            "I don't know how to make a purchase",
            "buy an item",
            "I want to make a purchase",
            "I don't know what to do to buy an item",
            "Buy an item",
            "where could I make an order?",
            "assistance buying something",
            "I want to buy an item",
            "I want help making a purchase",
            "I do not know what to do to buy an item",
            "can you help me to buy an item?",
            "I do not know how I can buy some items",
            "help to buy an item",
            "I've got to make an order"
        ],
        "responses": [
            "Placing an order is easy! Just visit our website, explore our range of products, and add your desired items to your cart. Then, proceed to checkout, fill in your shipping and payment details, and confirm your order. If you need any assistance along the way, feel free to ask our support team!",
            "Making a purchase with us is straightforward! Just hop onto our website, browse through our extensive collection, and add your favorite items to your cart. Then, head to checkout, where you can input your shipping and payment information to complete your order. Should you encounter any difficulties, don't hesitate to reach out to our support team!",
            "Placing an order has never been easier! Start by visiting our website, where you can explore our wide array of products. Once you've found what you need, simply add them to your cart, proceed to checkout, and enter your shipping and payment details. If you have any questions or need assistance, our support team is always available to help."
        ]
    },
    "Track Refund": {
        "patterns": [
            "what do I have to do to check my order ETA?",
            "assistance to check my refund status",
            "I need assistance checking the status of my refund",
            "I don't know how to check the status of my refund",
            "I cannot check the status of the refund",
            "I need to track the refund",
            "I can't check if there is any updates on my refund",
            "where do I check if there is anything new on my refund?",
            "I do not know how I can check the status of the refund",
            "I do not know what to do to check the status of the refund",
            "where do I check my refund status?",
            "I try to check the status of the refund",
            "track the refund",
            "help to check if there is anything new on my refund",
            "could I check the status of the refund?",
            "I want assistance tracking the refund",
            "I want to check the refund status",
            "I need to check if there is any updates on my refund",
            "I want assistance to check the refund status",
            "help me check the status of the refund",
            "help me to track the refund",
            "I have to check if there is any updates on my refund",
            "I have to track the refund",
            "I would like to check my refund status",
            "I do not know what to do to track the refund",
            "can you show me the status of the refund?",
            "how could I check the status of the refund?",
            "I need to check the status of the refund",
            "where could I check the status of the refund?",
            "checking refund status",
            "where can I check the refund status?",
            "I want assistance checking the status of the refund",
            "where could I check if there is anything new on my refund?",
            "I need help to check if there is anything new on my refund",
            "I have to check my refund status",
            "how could I track the refund?",
            "I need help checking if there is anything new on my refund",
            "I want help tracking the refund",
            "I would like to check the refund status",
            "I would like to check if there is anything new on my refund",
            "track refund",
            "I need assistance to check my refund status",
            "where do I check the refund status?",
            "I have got to check the refund status",
            "where can I check if there is anything wrong with my refund?",
            "I don't know what I need to do to check my refund status",
            "I want help to check the refund status",
            "is it possible to check the status of my refund?",
            "could you show me my refund status?",
            "I have got to track the refund",
            "I don't know how to track the refund",
            "could you help me checking the refund status?",
            "I need to check if there is anything new on my refund",
            "can I check the refund status?",
            "can you help me checking the refund status?",
            "I want help checking if there is any updates on my refund",
            "can you help me to check the status of the refund?",
            "I need help checking if there is any updates on my refund",
            "I want assistance checking the status of my refund",
            "I want help checking if there is anything new on my refund",
            "I need assistance to check the status of the refund",
            "I cannot check if there is any updates on my refund",
            "I can't check if there is anything new on my refund",
            "help me checking the refund status",
            "how do I check if there is anything wrong with my refund?",
            "I want help to check my refund status",
            "I need help tracking the refund",
            "help me to check if there is anything wrong with my refund",
            "help me check the status of my refund",
            "help me checking if there is anything new on my refund",
            "how could I check if there is any updates on my refund?",
            "where can I check the status of the refund?",
            "I need help to track the refund",
            "help to check my refund status",
            "could I check my refund status?",
            "I need assistance to track the refund",
            "I don't know how I can check my refund status",
            "what do I have to do to check the status of my refund?",
            "I want help to check the status of the refund",
            "I want to track the refund",
            "I don't know how to check my refund status",
            "I cannot check if there is anything new on my refund",
            "how can I check if there is anything new on my refund?",
            "I have to check the status of my refund",
            "can you help me check my refund status?",
            "how to track the refund?",
            "I do not know what I need to do to track the refund",
            "where can I track the refund?",
            "I do not know what I have to do to check the refund status",
            "how to check my refund status?",
            "I want help to check if there is any updates on my refund",
            "could you help me check the status of the refund?",
            "assistance to check the status of the refund",
            "can you help me checking the status of the refund?",
            "I don't know how I could track the refund",
            ""
        ],
        "responses": [
            "Sorry, we do not provide a service to track your refund. However, you should expect your refund within 3-5 working days after your item(s) have been successfully processed. For further assistance, give us a call on 020 7365 7315.",
            "Unfortunately, we don't have a tracking system for refunds. Your refund should be processed within 3-5 working days after the successful processing of your item(s). If you need further assistance, feel free to contact us at 020 7365 7315.",
            "I'm sorry, but we don't have a tracking option for refunds. Your refund should be processed within 3-5 working days after your item(s) have been successfully processed. For any additional assistance, please reach out to us at 020 7365 7315."
        ]
    },
    "Track Order": {
        "patterns": [
            "Track order",
            "Where's my order",
            "Is there a way to check the status of my order",
            "Can you help me track my order",
            "Where can I find the tracking information for my order",
            "How can I monitor the progress of my order",
            "Do you offer order tracking services",
            "What's the status of my delivery",
            "Can you provide me with the tracking details for my order",
            "I'm looking for information on how to track my order.",
            "Where is my delivery",
            "Can you tell me the status of my delivery",
            "Where's my package",
            "I'm wondering about the whereabouts of my delivery",
            "Has my delivery been dispatched",
            "Can you provide an update on my delivery",
            "Where is my order in the delivery process",
            "I'm curious about the location of my delivery",
            "When can I expect my delivery",
            "Is my delivery on its way",
            "is it possible to track the last order?I need help to check my order ETAI do not know how to check the status of my orderhow do I check the status of my order?assistance tracking the last order",
            "order ETA",
            "help tracking my order",
            "I don't know how to check my order ETA",
            "how do I check my order ETA?",
            "how do I track an order?",
            "I do not know what I need to do to track the last order",
            "I do not know how to check my order ETA",
            "I have to check the status of my order",
            "how do I track the last order?",
            "where could I track an order?",
            "assistance tracking my order",
            "could you help me track the last order?",
            "I do not know how I can check my order ETA",
            "help me to track the last order",
            "I cannot track my order",
            "I am trying to track the last order",
            "can I track my last order?",
            "is it possible to track my last order?",
            "I do not know what to do to check my order ETA",
            "what do I have to do to track my order?",
            "can you help me to track an order?",
            "where could I track the last order?",
            "would it be possible to check my order ETA?",
            "how can I check my order ETA?",
            "I don't know how to track the last order",
            "will you show me my order ETA?",
            "when will I receive my order?",
            "help me track an order",
            "how to check my order ETA?",
            "could you help me to track an order?",
            "I do not know what to do to track an order",
            "check order ETA",
            "I want to track an order",
            "I do not know what to do to track my order",
            "check status of order",
            "what do I need to do to track my last order?",
            "I do not know what I have to do to track the last order",
            "where to check my order ETA?",
            "I want help to track my order",
            "can you help me tracking my last order?",
            "I don't know how I could check the status of my order",
            "help me to check the status of my order",
            "I do not know what I have to do to track my order",
            "I want help to check my order ETA",
            "I can't check the status of my order",
            "where to track an order?",
            "I don't know what to do to check the status of my order",
            "where could I check the status of my order?",
            "what do I have to do to track my last order?",
            "I don't know what I need to do to track the last order",
            "what do I have to do to track the last order?",
            "I can't check my order ETA",
            "I do not know what I need to do to track my order",
            "where do I track my order?",
            "I have to track an order",
            "could you help me track my order?",
            "I don't know what to do to check my order ETA",
            "check my order ETA",
            "how can I track my last order?",
            "assistance to track my order",
            "could you help me tracking an order?",
            "I want assistance to track my last order",
            "I need help to track my last order",
            "help to check the status of my order",
            "I don't know how to track my last order",
            "how to track my last order?",
            "can you help me to check my order ETA?",
            "where to check the status of my order?",
            "help me track my last order",
            "I don't know what I have to do to track my order",
            "where can I check my order ETA?",
            "I can't track my order",
            "how could I track an order?",
            "can you help me check the status of my order?",
            "I don't know what to do to track my last order",
            "I don't know how I can check my order ETA",
            "how can I track an order?",
            "can you help me track the last order?",
            "I need assistance tracking my last order",
            "I am trying to track my last order",
            "could you show me my order ETA?",
            "checking order ETA",
            ""
        ],
        "responses": [
            "With our specialized Order Tracking System, tracking your order is easy. Just enter your email address and order number to find out the status of your order delivery in seconds.",
            "You have the option to track your order through our dedicated Order Tracking System. Just input your email address and order number, and you'll quickly locate the whereabouts of your delivery.",
            "Find out the whereabouts of your order in real time using our Order Tracking System. Enter your email address and order number, and you'll receive detailed information about your delivery."
        ]
    },
    "Cancel Order": {
        "patterns": [
            "cancel order",
            "can I cancel an order",
            "How do I cancel my order?",
            "Is it possible to cancel my order?",
            "Can I cancel an order?",
            "What's the process for canceling an order",
            "I want to cancel my order. How can I do that",
            "Can I still cancel my order at this point",
            "Is there a way to cancel my order before it's shipped",
            "I need to cancel my order. What steps should I take",
            "Can you help me cancel my order",
            "I've changed my mind. Can I cancel my order",
            "I have problems with canceling an order",
            "how can I find information about canceling orders?",
            "I need help with canceling the last order",
            "could you help me cancel the last order I made?",
            "problem with canceling an order I made",
            "can you help me cancel my last order?",
            "I do not know how to cancel the last order I have made",
            "problems with canceling my orders",
            "I have problems with canceling the last order I have made",
            "could you give me information about order cancellations?",
            "I need help canceling the last order I have made",
            "I need help with canceling the order I made",
            "I do not want the order",
            "how could I find information about cancelling an order?",
            "would you give me information about order cancellations?",
            "I have problems with cancelling my order",
            "how to cancel an order?",
            "I have problems with cancelling an order I have made",
            "assistance with cancelling the order I made",
            "can you give me information about canceling an order?",
            "problems with canceling orders",
            "I do not know how I can cancel the last order I made",
            "I would like to cancel the order I made",
            "I need help canceling an order",
            "how could I get information about cancelling an order?",
            "I need help cancelling an order I made",
            "I have problems with cancelling orders",
            "I have a question about canceling an order",
            "problem with cancelling orders",
            "problems with cancelling an order",
            "how could I cancel an order?",
            "where could I get information about order cancellations?"
        ],
        "responses": [
            "You can cancel your Adidas order online within 15 minutes of placing the order. To cancel it, go to your order tracker and click cancel it. Click here to find the steps involved in detail",
            "You can cancel your Adidas order online within 15 minutes of placing it. Just access your order tracker and choose the cancel option. For more detailed instructions, click here.",
            "If you need to cancel your Adidas order placed online, you have 15 minutes to do so via your order tracker. Click on cancel to initiate the process. For step-by-step guidance, click here."
        ]
    },
    "Order Cancellation Fee": {
        "patterns": [
            "I don't know what I need to do to check the early exit fees",
            "assistance to check the early termination penalty",
            "i cannot find the early exit penalties. can you help me",
            "i want assistance checking the early exit fee",
            "I need assistance to check the cancellation fee",
            "I cannot find the cancellation fee",
            "help me to check the cancellation fee",
            "want help to see the cancellation penalty",
            "need help seeing the withdrawal penalties",
            "i want assistance checking the early termination fees",
            "i have to see the early exit fees can i get some help",
            "help checking the cancellation penalty",
            "I cannot find the cancellation fees",
            "I would like to check the cancellation fees",
            "check the cancellation fees",
            "how to see the withdrawal charge",
            "assistance to check the early termination fees",
            "what do I need to do to check the cancellation fee?",
            "help checking the cancellation fees",
            "where could I check the cancellation fees?",
            "wanna check the termination fee",
            "I want assistance checking the goddamn early exit penalties",
            "I don't know how I can check the cancellation fee",
            "see the early termination fees",
            "where can I see the termination fees?",
            "I don't know what to do to check the cancellation fees",
            "I want to check the cancellation fee",
            "I can't find the cancellation fees",
            "where can I check the cancellation fee?",
            "how much will you charge me if I break the contract?",
            "I would like to check the cancellation fee",
            "check the early exit penalty",
            "I do not know how I could check the cancellation fee",
            "i  do not know how i can see the early exit penalty",
            "could you help me check the cancellation fee?",
            "I want help to see the early exit charges",
            "I don't know what to do to see the withdrawal fees",
            "I don't know how to check the cancellation fee",
            "would it be possible to check the cancellation fees?",
            "can you help me checking the termination charge?",
            "check cancellation fee",
            "help checking the withdrawal charges",
            "where can I check the cancellation fees?",
            "i need help to see the cancellation penalty",
            "need to check the cancellation charge",
            "how to check the cancellation fees?",
            "I am trying to see the goddamn early termination charges",
            "where do I check the cancellation fee?",
            "what are the cancellation fees?",
            "can you show me the termination penalty?I try to check the cancellation fee",
            "where to check the termination penalties",
            "I want to check the early exit fee",
            "what is the cancellation fee?",
            "how could I check the cancellation fees?",
            "I want help to check the cancellation fees",
            "how do I check the cancellation fees?",
            "I do not know how I could check the cancellation fees",
            "can u help me seeing the cancellation fees",
            "I don't know how to check the termination penaltiesI need to check the cancellation fees",
            "I don't know what to do to check the cancellation fee",
            "how do I check the cancellation fee?",
            "I do not know how to check the cancellation fee",
            "I need assistance to check the early termination charges",
            "I want help checking the cancellation fee",
            "need assistance seeing the termination charges",
            ""
        ],
        "responses": [
            "You will either not be charged a fee and you'll receive a refund for the canceled products. Once your cancelation has been processed (within 2 - 4 hours), we'll send a confirmation email to the address you used to place your order",
            "There are no cancellation fees, and you'll receive a refund for any canceled products. Once your cancellation is processed (usually within 2 - 4 hours), we'll send a confirmation email to the email address you provided during checkout",
            "For canceled items, you won't face any charges, and a refund will be issued. After your cancellation is processed (typically within 2 - 4 hours), you'll receive a confirmation email at the email address you provided when placing your order."
        ]
    },
    "Order Change": {
        "patterns": [
            "can you help me to add something to an order?",
            "can you help me remove some items?",
            "help adding an item",
            "I try to change my last order",
            "could I add an item to an order?",
            "I have problems with removing an item",
            "I have a problem with removing several items",
            "I have to change my order",
            "I have a problem with removing something",
            "I have got to change several items of an order",
            "I don't know how I could add something",
            "I don't know how to change an item of an order",
            "assistance with removing several items from an order",
            "I want assistance to change an order I made",
            "how can I change something of an order?",
            "I need help with removing something",
            "I need help to add several items",
            "I would like to add several items to an order",
            "I don't know how I can remove several items from an order",
            "can I change the order I made?",
            "could you help me change my order?",
            "I need help with changing the order I made",
            "can you help me to remove something?",
            "how to add something?",
            "assistance changing the last order I made",
            "can you help me to remove an item?",
            "how to change an order?",
            "help to add several items to an order",
            "I want to remove an item from an order",
            "I have to remove several items",
            "I have forgotten to include an item",
            "could I add something to an order?",
            "I have to add something",
            "remove some items from an order",
            "help me remove an item from an order",
            "can you help me change the order I made?",
            "remove item from order",
            "question about changing an order",
            "how could I remove several items from an order?",
            "I have to add several items to an order",
            "problem with adding something",
            "change an order",
            "can you help me to change an order I have made?",
            "could you help me add something to an order?",
            "could you help me change the order I have made?",
            "help to add an item",
            "is it possible to change the order I have made?",
            "help to change an order I have made",
            "help me change something of an order",
            "I don't know how to remove an item from an order",
            "question about changing my order",
            "I am trying to change my last order",
            "help to change an item of an order",
            "I need help changing my order",
            "I need to change the last order I have made",
            "I need assistance to change an order",
            "I have missed some items in the order",
            "is it possible to change an order I have made?",
            "I do not know how to add an item",
            "I need assistance with changing the order I have made",
            "can you help me remove several items from an order?",
            "can you help me remove several items?",
            "I want assistance to change the last order",
            "I don't know how to remove some items",
            "I need help to change several items of an order",
            "help me remove several items",
            "I have problems with adding something",
            "I try to add something",
            "problems with changing my last order",
            "I have a question about changing the last order I have made",
            "help with adding some items",
            "is it possible to add some items to an order?",
            "can you help me to remove several items?",
            "I can't remove some items",
            "how do I add several items to an order?",
            "I want to remove some items from an order",
            "I need assistance with adding some items",
            "I would like to remove something",
            "I need help with removing an item",
            "could you help me to remove an item?",
            "I have to remove several items from an order",
            "I try to remove something from an order",
            "I have problems with adding some items to an order",
            "assistance to add something",
            "how can I add an item to an order?",
            "how can I remove several items from an order?",
            "I want help adding several items to an order",
            "I do not know how I could add something",
            "problem with changing an order",
            "is it possible to change an order I made?",
            "I need help to change something of an order",
            "how can I remove some items from an order?",
            "I don't know how I can add an item",
            "I am trying to change the last order I made",
            "I cannot remove some items from an order",
            "I want assistance to change an order I have made",
            "assistance to remove an item",
            "I have problems with removing something",
            "assistance to change an order",
            "help me change an item of an order",
            "how can I get information about changing orders?",
            "I want assistance to change an item in an order",
            "I need help to change an order I made",
            "can you help me add several items to an order?",
            "how do I change several items in an order?",
            "how could I get information about order changes?",
            "can you help me to add some items?",
            "I have got to remove something",
            "I need help with adding an item to an order",
            "I have a problem with changing the order I have made",
            "problems with adding an item to an order",
            "information about changing orders",
            "how to change the last order I have made?",
            "I want assistance to remove something from an order",
            "I need assistance to change the last order",
            "I do not know how I can add an item",
            "I have a problem with changing some items in an order",
            "assistance changing my last order",
            "I have problems with changing something in an order",
            "I have problems with removing something from an order",
            "I have to change my last order",
            "could you help me remove some items from an order?"
        ],
        "responses": [
            "After completing your online order, within 15 minutes of purchase, you can cancel it entirely or partially. But we can't offer the option to change e.g. amount of items, different sizes or colors or your personal details.",
            "You have a 15-minute window after completing your online order to cancel it entirely or partially. However, we're unable to accommodate change your order, such as adjusting item quantities, sizes, colors, or personal details.",
            ""
        ]
    },
    "Order Confirmation": {
        "patterns": [
            "Can I get a confirmation for my order?",
            "Where can I find my order confirmation?",
            "How do I receive my order confirmation?",
            "Can you confirm that my order went through?",
            "I need confirmation of my recent order.",
            "How long does it take to receive an order confirmation?",
            "Is there a way to resend my order confirmation?",
            "I haven't received my order confirmation yet. What should I do?",
            "Can you verify if my order was successfully confirmed?",
            ""
        ],
        "responses": [
            "Once your payment is successfully processed, you will receive a confirmation email with details of your order. Please allow some time for the confirmation email to arrive, and feel free to reach out if you have any further questions.",
            "After making a payment, you should receive a confirmation email shortly with all the details of your order. If you haven't received it yet, please check your spam or junk folder, as it may have been filtered there. If you still can't find it, feel free to contact us for assistance.",
            "You will receive a payment confirmation email once your payment is successfully processed. This email will contain all the details of your order, including the items purchased and payment information. If you haven't received the confirmation email within a reasonable time, please let us know.",
            "Upon successful payment processing, you will receive a confirmation email containing all the details of your order. This email serves as your receipt. If you haven't received the confirmation email within a reasonable time, please reach out to us, and we'll be happy to assist you."
        ]
    },
    "Order Delivery Instructions": {
        "patterns": [
            "Give delivery instructions",
            "Change delivery instructions",
            "I want my order delivered to another location",
            "Deliver to another location",
            "Drop my order in another location",
            "Delivery location for my order",
            "Special request on where to drop my order",
            "Let me tell you where to deliver my order",
            "Can I provide specific delivery instructions for my order?",
            "Where can I add delivery instructions to my order?",
            "How can I give special delivery instructions?",
            "Is there a way to include delivery preferences with my order?",
            "Can I leave specific delivery notes for the courier?",
            "Where do I enter delivery instructions during checkout?",
            "Are there options to customize my delivery instructions?",
            "Can I request specific delivery time slots for my order?",
            "How do I ensure my package is left in a secure location?",
            "Can I specify where to leave my package if I'm not home?",
            "Can I schedule a specific delivery date or time",
            "Can I opt for scheduled delivery",
            "Are there any specific delivery time slots available?"
        ],
        "responses": [
            "Before checking out, you can specify the exact place and location of your delivery. You can also leave instructions about where to drop your order if you're not at home. If you want to modify or add to your delivery instructions, please speak to a live chat agent and provide details.",
            "Before completing your purchase, you can specify detailed delivery instructions, such as the exact place and location for your delivery. You can also leave instructions for the delivery drop-off if you're not present at home. If you need to update or include additional delivery instructions, please contact a live chat agent and provide the details.",
            "During the checkout process, you have the option to provide specific delivery instructions, including the exact place and location for your delivery. Additionally, you can leave instructions on where to drop your order if you're unavailable at home. For any modifications or additional instructions, please reach out to a live chat agent."
        ]
    },
    "Order Packing Requests": {
        "patterns": [
            "Can I make special packing requests for my order?",
            "Where can I specify special packing instructions for my order?",
            "How do I request specific packaging for my order?",
            "Is there a way to customize the packing of my order?",
            "Can I include special packing notes with my order?",
            "Where do I input packing preferences during checkout?",
            "Are there options to customize the packing of my order?",
            "Can I request eco-friendly packaging for my order?",
            "How can I ensure my order is packed securely?",
            "Can I request discreet packaging for my order?"
        ],
        "responses": [
            "If you have any specific packing instructions, please contact us via phone or WhatsApp at 020 7365 7315. Kindly ensure you inform us within 1 hour of placing your order.",
            "If you require any specific packing arrangements, please get in touch with us via phone or WhatsApp at 020 7365 7315. We kindly ask that you inform us within 1 hour of placing your order.",
            "For any specific packing requests, please reach out to us via phone or WhatsApp at 020 7365 7315. We kindly request that you inform us of this within 1 hour of placing your order."
        ]
    },
    "Return Process": {
        "patterns": [
            "Return an item",
            "What's the process involved in returning an item",
            "I got the wrong item",
            "This is not what I ordered",
            "How do I initiate a return for my recent purchase",
            "What is your return policy",
            "Can I return an item if it's damaged or defective?Do I need to provide a reason for the return?How do I package the item for return shipping?Where do I send the return package?How long does it take to process a return and receive my refund?Are there any items that cannot be returned?Do I need to pay for return shipping?What do I do if I receive the wrong item or an item is missing from my order?Can I return an online purchase in-store?What should I do if I don't have the original packaging for the item I want to return?Can I return an item without a receipt?Are there any special instructions for returning oversized or bulky items?I'd like to return an item.",
            "What's the procedure for returning an item",
            "I received the wrong item.",
            "This isn't the item I ordered.",
            "How do I start the return process for my recent purchase?",
            "Could you guide me through the return process?",
            "I want to return a product. What should I do?",
            "What are the steps involved in returning an item?",
            "I need to return something I bought. What's the process?",
            "Can you provide details about your return policy",
            ""
        ],
        "responses": [
            "Returning an Adidas item is easy peasy and free. But make sure you return it to the store within 30 days from the date of purchase. Find out more about our refund policy here.",
            "Returning your Adidas item is simple and free! Just remember to bring it back to the store within 30 days of purchase. To learn more about our refund policy, click here.",
            "Returning an Adidas item is straightforward and free of charge! Just ensure it's returned to the store within 30 days of purchase. Click here to read more about our refund policy."
        ]
    },
    "Return Location": {
        "patterns": [
            "Where can I return my item?",
            "What's the nearest return location?",
            "Where is the closest place to return my purchase?",
            "Can you tell me where to return my item?",
            "How do I find the return location?",
            "Where should I drop off my return?",
            "What are the return locations for Adidas?",
            "Is there a specific store for returns?",
            "Can you provide the address for the return location?",
            "Where do I need to go to return my order?",
            "Where should I drop off my order",
            "How can I drop my order",
            "Location to return my item",
            "Place to return my item"
        ],
        "responses": [
            "You can return your Adidas item to one of our retail stores within the same country and our in-store team will be able to process an exchange or a refund for you. Please be sure to bring with you proof of purchase, such as till receipt. If you'd like to return your items online via post, please visit our order tracker.",
            "You're welcome to return your Adidas item to any of our retail stores within the same country. Our in-store team will gladly assist you with processing an exchange or refund. Please remember to bring proof of purchase, such as your till receipt. Alternatively, if you prefer to return your items online via post, please visit our order tracker.",
            "Feel free to return your Adidas item to one of our retail stores located in the same country. Our in-store team will be happy to help you with an exchange or refund. Don't forget to bring proof of purchase, such as your till receipt. If you prefer to return your items online via post, you can do so by visiting our order tracker."
        ]
    },
    "Return Processing Time": {
        "patterns": [
            "Timeline for return",
            "How long do returns take",
            "How long before my return is complete",
            "What's the timeline for returns?",
            "How long does the return process take?",
            "How long will it take for my return to be processed?",
            "What's the expected timeframe for completing a return?",
            "How much time does it usually take for returns to be finalized?",
            "Can you provide an estimate of the return timeline?",
            "What's the typical turnaround time for returns?",
            "When can I expect my return to be completed?",
            "Is there a standard time frame for processing returns?",
            "How many days does it usually take for returns to be processed?",
            ""
        ],
        "responses": [
            "Once your return arrives at one of our warehouses and the quality has been approved, we’ll initiate your refund within 14 business days. Click here for more information about our refund policy. If you require further assistance, please contact live chat.",
            "Once your returned item reaches our warehouse and passes inspection, we'll begin processing your refund within 14 business days. For more details on our refund policy, click here. If you need additional assistance, don't hesitate to reach out via live chat",
            "After your returned product is received and approved at our facility, we'll initiate your refund within 14 business days. For detailed insights into our refund policy, please visit this page. Should you require further support, our live chat is available to assist you",
            "Once your return is received and verified for quality, we'll promptly begin processing your refund within 14 business days. To learn more about our refund policy, click here. If you need any further assistance, our live chat team is ready to help."
        ]
    },
    "Return Tracking": {
        "patterns": [
            "How can I track the status of my return?",
            "Track my return",
            "Where's my return",
            "How can I track the status of my return?",
            "Where's my return?",
            "Can I check the progress of my return?",
            "Is there a way to monitor my return?",
            "How do I follow up on my return?",
            "Can you provide updates on my return?",
            "Where can I see the status of my return?",
            "Is there a tracking number for my return?",
            "How do I know if my return has been processed?"
        ],
        "responses": [
            "Tracking your return is nice and easy. Simply visit our order tracker, enter your email address and order number, and get real-time updates on your return",
            "You can easily track your return by visiting our order tracker. Simply enter your email address and order number, and you'll get instant updates on the status of your return.",
            "We've made it easy for you to track your return. Just go to our order tracker, enter your email address and order number, and you'll receive timely updates on the status of your return"
        ]
    },
    "Refund Payment Method": {
        "patterns": [
            "Can I choose the method of refund",
            "I want to receive my refund with another payment method",
            "Receive refund with new card details",
            "Get my refund with another payment option",
            "Give me my money back with new payment details",
            "Where will I receive my refund",
            "Where can I expect my refund",
            "Can I select a different payment method for my refund",
            "How can I change the payment method for my refund",
            "Is it possible to receive my refund through a different payment option",
            "I want to get my refund in my Apple Pay Wallet",
            "Get my money back in my Google Pay Wallet",
            "Get my refund with another bank details",
            "Can I specify the payment method for my refund?",
            "I'd like to choose a different payment option for my refund.",
            "How do I update my refund payment details?",
            "Can I opt for a refund to a different card/account?",
            "Is there a way to change the payment details for my refund?",
            "Where can I provide new payment information for my refund?",
            "Can I receive my refund via bank transfer?",
            ""
        ],
        "responses": [
            "Typically, our refund will be credited back to the original payment method you used for the order. And there's no option to change your payment option at the return stage.",
            "Generally, our refunds are credited back to the original payment method you used for the order. Please note that changes to the payment option aren't possible at the return stage.",
            "As per our standard policy, refunds are credited back to the original payment method you used for the order. Please be aware that it's not possible to change your payment option during the return stage."
        ]
    },
    "Refund Issues": {
        "patterns": [
            "What should I do if I haven't received my refund within the expected timeframe?",
            "My refund is taking longer than expected.",
            "There seems to be an issue with my refund.",
            "My refund is due but hasn't appeared in my account",
            "There is a problem with my refund.",
            "I need assistance with my refund.",
            "Why has my refund not been processed yet?",
            "It's been longer than expected, and my refund hasn't arrived.",
            "I've been waiting for my refund, but it hasn't shown up.",
            "What steps should I take if my refund is delayed?",
            "My refund seems to be delayed",
            " what should I do?",
            "I'm experiencing a delay with my refund",
            " can you assist?",
            "My refund hasn't been processed yet",
            " what's the reason?",
            "What actions should I take if my refund is overdue?",
            "I'm concerned about the status of my refund",
            " can you assist?",
            "How can I resolve an issue with my pending refund?",
            "What recourse do I have if my refund is taking longer than anticipated?",
            "My refund hasn't been received",
            " what should be my next step?"
        ],
        "responses": [
            "Oops. We apologize for the inconvenience you're facing. If your refund hasn't arrived within the usual 14 working days, we recommend contacting your bank or card issuer for further assistance. Additionally, feel free to reach out to our dedicated team at 020 7365 7315 for personalized support.",
            "We're sorry to hear about your refund delay. If it's been more than the standard 14 working days and you haven't received your refund, we suggest contacting your bank or card issuer. For additional assistance, don't hesitate to contact us directly at 020 7365 7315.",
            "We're sorry for any inconvenience caused by the delay in your refund. If it's been more than the standard 14 working days and you haven't received it, we recommend contacting your bank or card issuer. Feel free to reach out to us at 020 7365 7315 for further support."
        ]
    },
    "Refund Policy": {
        "patterns": [
            "Can I receive a refund if I've received the wrong item or if an item is damaged?",
            "What is the refund policy regarding receiving incorrect or damaged items?",
            "If I receive the wrong item or if an item arrives damaged, am I eligible for a refund?",
            "What are the procedures for obtaining a refund if the received item is incorrect or damaged?",
            "Is there a refund available for items that arrive in the wrong condition or are damaged?",
            "In the event of receiving an incorrect or damaged item, how can I initiate the refund process?",
            "Are refunds offered for items that are received incorrectly or in a damaged condition?",
            "What options are available for refunds if the item received doesn't match the order or is damaged?",
            "If I receive a damaged or incorrect item, what steps should I take to request a refund?",
            "Under what circumstances can I request a refund if the item I receive is incorrect or arrives damaged?",
            "What is the refund policy if I've changed my mind about the purchase and want to return the item?",
            "Can I receive a refund if the item I ordered doesn't fit me correctly?",
            "Is there a refund available if the product I received doesn't match the description or images online?",
            "What are the procedures for obtaining a refund if I accidentally ordered the wrong product?",
            "Can I get a refund if the product I received is of poor quality or doesn't meet my expectations?",
            "If I find a better deal elsewhere after purchasing, am I eligible for a refund or price adjustment?",
            "Is there a refund policy in place for pre-ordered items if I change my mind before the release date?",
            "What options are available for refunds if the product I received is missing parts or accessories?",
            "If I receive a damaged package but the product inside is intact, can I still request a refund?",
            "Are refunds offered for digital products or services if they don't meet my expectations or requirements?",
            "Can I request a refund for a digital or downloadable product?",
            "Can I request a refund for a gift order?",
            "What happens if I return an item after the refund period has expired?",
            "Can I receive a refund for an item purchased with store credit?"
        ],
        "responses": [
            "If we send you a wrong or damaged item, you can easily initiate your return and refund here. For more inquiries about our return policy, including what qualifies for a refund, this page should be helpful.",
            "If your item arrives damaged or if you receive the wrong product, don't worry! You can easily initiate your return and refund process here. For additional details on our return policy, including what qualifies for a refund, feel free to check out this page.",
            "Should you receive a wrong or damaged item, rest assured, initiating your return and refund is straightforward. Begin the process here. To learn more about our return policy and what qualifies for a refund, please visit this page."
        ]
    },
    "Delivery Methods": {
        "patterns": [
            "What delivery options are available for my order?",
            "What delivery methods do you offer?",
            "How are orders typically shipped?",
            "Is there a standard delivery option?",
            "Are there any expedited delivery options?",
            "What's the fastest delivery method",
            "Fastest shipping method",
            "I want express delivery",
            "I want next day delivery",
            "I would like to get my order today",
            "I want my order tomorrow",
            "Do you provide same-day delivery options?",
            "Is there a pick-up option available for my order?",
            "Do you offer weekend delivery services",
            "Can I choose a specific courier for my delivery",
            "Is there an option for free shipping",
            "Do you provide delivery to P.O. boxes"
        ],
        "responses": [
            "At Adidas, we offer various shipping options, each with its own estimated delivery times. Our express delivery service, with Royal Mail, is typically the fastest, taking only 1-2 calendar days. You can find more information about our delivery options and timelines here.",
            "Adidas provides a range of shipping options, each with its own estimated delivery times. For expedited delivery, our partnership with Royal Mail ensures swift delivery within 1-2 calendar days. Discover more about our delivery choices and timelines here.",
            "When it comes to shipping, Adidas offers flexibility to accommodate your preferences. With our express delivery service, managed by Royal Mail, your order can reach you in as little as 1-2 calendar days. Explore our delivery options and schedules for more information",
            ""
        ]
    },
    "Click and Collect": {
        "patterns": [
            "I want click and collect",
            "Can I choose click and collect as a delivery option",
            "Is click and collect available for my order?",
            "Can I opt for click and collect as my delivery option?",
            "Do you offer click and collect services?",
            "How can I select click and collect for my order?",
            "Is there an option for me to collect my order in-store?",
            "Can I choose to pick up my order myself?",
            "Is click and collect an available delivery method?",
            "Do you provide a click and collect service for online orders?",
            "Can I arrange to collect my order from a store near me?",
            "Is there an option for me to collect my order from a designated location?",
            "What products are available for click and collect?",
            "How do I know which products are eligible for click and collect?Eligible click and collect items",
            "Eligible click and collect products"
        ],
        "responses": [
            "Click & Collect is available for most products offered on our Online Shop. If the item(s) you select are not available for this service, Click & Collect will simply not show up as a delivery option.",
            "Most products offered on our Online Shop are eligible for Click & Collect. If you don't see this option during checkout, it means the selected item(s) are not available for this service.",
            "At our Online Shop, Click & Collect is typically available for most products. If you're unable to select this option during checkout, it means the chosen item(s) are not eligible for Click & Collect."
        ]
    },
    "Delivery Timeline": {
        "patterns": [
            "How long does standard shipping usually take?",
            "What is the expected delivery timeline for my order?",
            "Can you provide information on the estimated delivery timeframe?",
            "How long does it usually take for orders to be delivered?",
            "What is the typical delivery time for orders placed on your website?",
            "Can you give me an idea of when I can expect my order to arrive?",
            "What is the average delivery duration for orders?",
            "How soon can I anticipate receiving my order after purchase?",
            "What is the standard turnaround time for order deliveries?",
            "Do you have an estimated shipping timeline for my area?",
            "How long does standard shipping take?",
            "Time for standard shipping",
            "How long does express delivery take",
            "My delivery is taking too long",
            "How long before Royal Mail delivers",
            "Royal Mail is delaying my delivery",
            "Evri order has not yet arrived",
            "When will my Evri order arrive",
            "When will my items arrive",
            "When can I expect my order",
            "When should I expect my delivery"
        ],
        "responses": [
            "The delivery timeline for your order varies based on the chosen shipping method. Opting for express delivery ensures the quickest processing, usually within 1-3 calendar days. You can explore additional delivery methods here.",
            "Your delivery timeline will depend on your chosen shipping method. Express delivery is the quickest, typically processed within 1-3 calendar days. Find out about other delivery methods here.",
            "Your order's delivery timeline varies based on your selected shipping method. For swifter processing, consider our express delivery option, which usually takes 1-3 calendar days. Check out other delivery methods here."
        ]
    },
    "Change Delivery Address": {
        "patterns": [
            "Change order delivery address",
            "How can I change my shipping address",
            "How can I change the delivery address for my order?",
            "Is it possible to update the delivery address after placing my order?",
            "Can I change the address for delivery?",
            "I need to modify the delivery address. How can I do that?",
            "What is the process for updating the delivery address?",
            "Can you help me change the shipping address for my order?",
            "I entered the wrong delivery address. How can I correct it?",
            "Is there a way to edit the delivery address on my order?",
            "Can the delivery address be changed once the order has been confirmed?",
            "How do I go about changing the address where my order will be delivered?",
            "I entered the wrong shipping address",
            "Update delivery address",
            "I want a new delivery address",
            "My shipping address has changed"
        ],
        "responses": [
            "Unfortunately, after completing your order, you cannot change the delivery address. However, you can always cancel your order for free and re-order using your preferred shipping address. Follow these steps to cancel your online order.",
            "We apologize for any inconvenience, but we're unable to modify the delivery address once the order is finalized. To ensure accurate delivery, we recommend canceling the order and placing a new one with the correct shipping address. Here's how you can cancel your online order.",
            "Regrettably, once your order is placed, we're unable to alter the delivery address. However, you have the option to cancel the order free of charge and place a new order with your desired shipping address. Here's a guide on how to cancel your online order."
        ]
    },
    "Public Holidays": {
        "patterns": [
            "Will my order be processed on public holidays?",
            "Do you operate and ship orders on bank holidays?",
            "What happens to orders placed on public holidays?",
            "Will there be any delays in processing orders during public holidays?",
            "Do you have special arrangements for orders placed on bank holidays?",
            "How does order processing work on public holidays?",
            "Are orders fulfilled and shipped on public holidays?",
            "Can I expect my order to be processed on a bank holiday?",
            "Are there any changes to the order processing schedule during public holidays?",
            "What is the policy for orders placed around public holidays?",
            ""
        ],
        "responses": [
            "Bear in mind that orders placed on or 1 day before a public or bank holiday may take longer to be delivered.",
            "Please note that orders placed on or one day before a public or bank holiday may experience extended delivery times.",
            "Kindly be aware that orders made on or the day before a public or bank holiday may experience delays in delivery."
        ]
    },
    "Different Billing & Shipping Address": {
        "patterns": [
            "Can my delivery and billing address be different?",
            "Is it possible to use a different delivery address from my billing address?",
            "Can I have separate delivery and billing addresses for my order?",
            "Is there an option to use a different address for delivery than for billing?",
            "Can my delivery address differ from my billing address?",
            "Is it allowed to specify different addresses for delivery and billing?",
            "Can I enter a separate address for delivery and billing?",
            "Is there a way to use a different address for shipping than for billing?",
            "Can I provide a different address for delivery compared to billing?",
            "Is it permissible to have different addresses for delivery and billing?",
            "Can I use a separate address for shipping and billing?",
            ""
        ],
        "responses": [
            "Yes, your delivery address can be different from your billing address as long as both addresses are in the same country. All you need to do is untick the box that says 'My billing information is the same as my delivery information’ and then you can enter in your correct billing details.",
            "Yes, you can designate a different delivery address from your billing address, as long as they are within the same country. Just deselect the option 'My billing information is the same as my delivery information' and enter your correct billing information accordingly.",
            "Certainly! You have the option to specify a different delivery address than your billing address, provided they are located within the same country. Simply deselect the box labeled 'My billing information is the same as my delivery information' and enter the appropriate billing details."
        ]
    },
    "Shipping Delay": {
        "patterns": [
            "Cost of delivery:Delivery cost",
            "How much is your delivery",
            "Estimate of your delivery",
            "Don't know how much to pay for shipping",
            "Hope delivery is not expensive",
            "Hope shipping is cheap",
            "How much does shipping cost?",
            "Are there different shipping costs for different items?",
            "Do you offer free shipping",
            "Can I estimate shipping costs before completing my purchase",
            "Do you offer expedited shipping options, and how much do they cost?",
            "Are there any additional fees or surcharges associated with shipping?",
            "Can I combine multiple items into one shipment to save on shipping costs?",
            "Are shipping costs based on weight, dimensions, or destination?",
            "Do you offer shipping insurance, and how much does it cost?",
            "Are there any shipping costs for returns or exchanges?",
            "Are shipping costs the same for international orders?",
            "Can I see a breakdown of the shipping costs before I finalize my order?",
            "Do you offer flat-rate shipping options?",
            "Are there any shipping costs associated with gift orders?",
            "Do shipping costs vary depending on the delivery speed or shipping method?",
            "Are there any shipping costs for in-store pickup options?",
            ""
        ],
        "responses": [
            "We apologize for any inconvenience caused. Your order may not have been shipped yet due to various reasons such as product unavailability, delivery restrictions to your remote area, or a payment issue. You can find more details on why this might be happening here. Also, you can contact customer support for help.",
            " We're sorry for the delay. Your order might still be pending shipment due to reasons like product unavailability, delivery constraints in your area, or payment issues. For more insights into why this is happening, please visit here. Alternatively, contact customer support for help.",
            "We regret any inconvenience caused by the delay in shipping your order. Possible reasons include product unavailability, delivery restrictions in your area, or issues with payment processing. Discover more about these potential reasons here. Alternatively, contact customer support for help."
        ]
    },
    "Delivery Cost": {
        "patterns": [],
        "responses": [
            "Delivery cost depends on your delivery method. If you choose our Standard Home Delivery option, you'll be charged £3,99. Meanwhile, Express Delivery with Royal Mail is £5,95 and free for Members. Find out more about shipping costs here.",
            "The delivery cost varies depending on the delivery method you select. For our Standard Home Delivery option, the charge is £3.99. Alternatively, Express Delivery with Royal Mail is priced at £5.95, and it's complimentary for Members. Further details regarding shipping costs can be found here.",
            "Your delivery cost is contingent upon the chosen delivery method. Opting for our Standard Home Delivery incurs a fee of £3.99. Conversely, Express Delivery via Royal Mail is priced at £5.95, with Members enjoying complimentary service. For comprehensive information on shipping costs, refer to this guide."
        ]
    },
    "International Shipping Options": {
        "patterns": [
            "Do you offer international shipping?Which countries do you ship to internationally?What are the shipping rates for international orders?How long does international shipping typically take?Do you provide tracking information for international shipments?Are there any customs fees or duties associated with international orders?Can I ship to a different address than my billing address for international orders?Are there any restrictions on the items that can be shipped internationally?Can I choose the shipping carrier for international orders?Do you offer expedited shipping options for international orders?Can I track my international shipment online?Are there any special packaging requirements for international shipments?Can I request insurance for my international shipment?What happens if my international shipment is delayed or lost?Do you offer international returns and exchanges?How do you handle returns for international orders?Can I cancel or modify an international order after it's been placed?Are there any limitations on the size or weight of international shipments?Do you offer international shipping discounts or promotions?Is there a customer service number I can call for assistance with international shipping questions?"
        ],
        "responses": [
            "Sorry, we currently do not ship from our adidas.co.uk site or Adidas UK app to anywhere outside of the United Kingdom. However, we do accept orders, payments, and billing from other countries.",
            "We regret to inform you that our shipping services are currently limited to the United Kingdom through our adidas.co.uk site and Adidas UK app. However, we do accept orders, payments, and billing from other countries.",
            "Apologies for any inconvenience, but at this time, we exclusively ship orders from our adidas.co.uk site and Adidas UK app within the United Kingdom. Nevertheless, we welcome orders, payments, and billing from international customers."
        ]
    },
    "Expedited Shipping": {
        "patterns": [
            "Do you offer expedited shipping options?",
            "I want fast delivery",
            "I need my order as soon as possible",
            "Is it possible to get my delivery tomorrow",
            "Give me the quickest delivery service",
            "Are there any options for faster shipping?",
            "Do you provide expedited delivery services?",
            "Can I opt for express shipping?",
            "Is there a way to get my order quicker?",
            "Do you offer priority shipping?",
            "Can I upgrade to faster delivery?",
            "Are there expedited shipping choices available?",
            "Do you have any options for speedy delivery?",
            "Can I choose a quicker shipping method?",
            "Is there a way to expedite my order's delivery?"
        ],
        "responses": [
            "For the quickest delivery service, opt for Express Delivery with Royal Mail and get your products within 1-2 calendar days for a fee of £5,95. Alternatively, you can walk into the nearest Adidas store and purchase your item right away.",
            "To expedite your delivery, consider our Express Delivery option with Royal Mail for swift delivery within 1-2 calendar days, at a cost of £5.95. Alternatively, visit the nearest Adidas store for immediate purchase.",
            "For faster delivery, opt for our Express Delivery service via Royal Mail, guaranteeing delivery within 1-2 calendar days for £5.95. Alternatively, visit an Adidas store nearby to purchase your item instantly."
        ]
    },
    "Shipping Insurance Options": {
        "patterns": [
            "Do you offer shipping insurance for my order?What does shipping insurance cover?How much does shipping insurance cost?Can I choose to add shipping insurance to my order?Is shipping insurance automatically included with my order?What is the process for filing a claim with shipping insurance?Are there any restrictions on the items eligible for shipping insurance?Can I purchase shipping insurance for international orders?How do I know if my order is covered by shipping insurance?Are there any limitations on the coverage amount for shipping insurance?Can I track my order with shipping insurance?What happens if my order is lost, damaged, or stolen during shipping?Is shipping insurance optional or mandatory?Can I add shipping insurance after placing my order?Are there any exclusions or exceptions to the shipping insurance coverage?Can I purchase additional coverage above the standard shipping insurance?Can I cancel or modify the shipping insurance for my order?How long does it take to process a claim with shipping insurance?Do you offer refunds or replacements for orders covered by shipping insurance?"
        ],
        "responses": [
            "Unfortunately, we do not offer shipping insurance. We advise that you use a courier service that provides tracking and consider getting insurance to cover the cost of the items you're ordering or returning.",
            "We regret to inform you that we do not provide shipping insurance. We recommend using a courier service with tracking and suggest considering insurance to cover the value of your items during transit.",
            "We do not offer shipping insurance at this time. We suggest using a courier service with tracking capabilities and exploring insurance options to safeguard the value of your items in transit."
        ]
    },
    "Size Guides Shoes": {
        "patterns": [
            "What's the best way to find the right shoe size?",
            "How do I know my trainer size",
            "I don't know my trainer size",
            "What is my shoe size",
            "I'm confused about my sneaker size",
            "I'm not sure about my trainer size",
            "I've forgotten my trainer size",
            "Can you provide me with a shoe size guide?",
            "How do I determine the correct size for trainers?",
            "Do you have a size chart for shoes?",
            "Where can I find information about trainer sizes?",
            "Can you help me with shoe sizing?",
            "I'm unsure about my trainer size. Is there a guide available?",
            "How do I know which sneaker size to choose?",
            "What's the process for finding the right sneaker size?",
            "Can you assist me with sneaker size measurements?",
            "Can you help me understand how to use the sneaker size guide?",
            "How do I read the shoe size guide?",
            "How can I figure out my shoe size?",
            "What's the correct method for determining my trainer size?",
            "I'm unsure about my sneaker size. Can you help?",
            "How do I measure my foot for the right shoe size?",
            "Can you assist me in finding my correct shoe size?",
            "I'm having trouble determining my trainer size. Any advice?",
            "What's the recommended way to find the right size for my shoes?",
            "Is there a method for accurately determining my sneaker size?",
            "What's the process for finding the perfect shoe size?",
            "Do you have any tips for selecting the right size for my trainers?"
        ],
        "responses": [
            "We understand that finding the right shoe/trainer size can be tricky. Thanks to our easy-to-read sneaker size charts, you can easily find your perfect size before shopping.",
            "We know that determining the perfect shoe or trainer size can be challenging. With our user-friendly sneaker size charts, finding your ideal fit is a breeze.",
            "We recognize that selecting the right shoe or trainer size can be confusing. But thankfully, our clear and concise sneaker size charts make it simple to find your ideal fit before making a purchase."
        ]
    },
    "Size Guides Clothes": {
        "patterns": [
            "What's the best way to find the right trackpants size?",
            "How do I know my glove size",
            "I don't know my tracksuit size",
            "What is my tracksuit size",
            "I'm confused about my clothes size",
            "I'm not sure about my pants size",
            "I've forgotten my tracksuit size",
            "Can you provide me with a jacket size guide?",
            "How do I determine the correct size for trackpants?",
            "Do you have a size chart for clothes?",
            "Where can I find information about gloves sizes?",
            "Can you help me with pants sizing?",
            "I'm unsure about my pants size. Is there a guide available?",
            "How do I know which jacket size to choose?",
            "What's the process for finding the right gloves size?",
            "Can you assist me with clothes size measurements?",
            "Can you help me understand how to use the pants size guide?",
            "How do I read the gloves size guide?",
            "How can I figure out my clothes size?",
            "What's the correct method for determining my trackpants size?",
            "I'm unsure about my jacket size. Can you help?",
            "How do I measure my foot for the right gloves size?",
            "Can you assist me in finding my correct pants size?",
            "I'm having trouble determining my trackpants size. Any advice?",
            "What's the recommended way to find the right size for my clothes?",
            "Is there a method for accurately determining my gloves size?",
            "What's the process for finding the perfect jacket size?",
            "Do you have any tips for selecting the right size for my jackets?"
        ],
        "responses": [
            "We understand that finding the right clothes size can be tricky. Thanks to our easy-to-read clothing size charts, you can easily find your perfect size before shopping.",
            "We know that determining the perfect clothes size can be challenging. With our user-friendly clothing size charts, finding your ideal fit is a breeze.",
            "We recognize that selecting the right clothes size can be confusing. But thankfully, our clear and concise clothing size charts make it simple to find your ideal fit before making a purchase."
        ]
    },
    "Sizing Recommendations": {
        "patterns": [
            "Can you advise me on the right size based on my measurements?",
            "What's the best size for me considering my measurements?",
            "Can you help me choose the right size based on my body measurements?",
            "Could you guide me on the appropriate size given my measurements?",
            "What size do you recommend based on my measurements?",
            "Could you suggest a size for me based on my measurements?",
            ""
        ],
        "responses": [
            "To help you choose the right size, please measure your body accurately according to the guidelines in our size guide, then match your measurements to the chart.",
            "For the correct size, measure your body accurately using our size guide, then compare your measurements to the chart.",
            "To determine the best size, take precise body measurements according to our size guide, then find the matching size on the guide.",
            "Measure your body exactly as per our size guide, then use the chart to find the appropriate size for you.",
            ""
        ]
    },
    "Sizing Issues": {
        "patterns": [
            "The size guide was different from the size of the product.",
            "The actual size of the product didn't match what the guide suggested.",
            "The product's size didn't correspond to the size guide.",
            "The size listed in the guide didn't match the actual product size.",
            "The sizing chart didn't align with the product's actual size.",
            "The product size didn't match the sizing guide.",
            "The size guide provided incorrect sizing for the product.",
            "The size indicated on the chart didn't match the actual product size.",
            "The size guide and the product size were inconsistent.",
            "Your size guide is wrong",
            "Fix your size guide",
            "Your size guide needs improvement",
            "The size guide is rubbish",
            "My trainer is too big",
            "My trainer is too small",
            "My trainer is tight on my feet",
            "My shoes are not my size",
            "My shoe is smaller than my feet",
            "My clothes don't fit",
            "My clothes are too big",
            "My clothes are too small",
            "These are baggy clothes, I ordered a smaller size",
            "My clothes are not my size"
        ],
        "responses": [
            "Thanks for bringing this up. I'll let the team responsible for size guides know so they can make adjustments. If you've already made a purchase, you can head over to our Order Tracker page and initiate a return. It's completely free of charge within the first 100 days.",
            "Thank you for bringing this to our attention. I'll inform our size guide team so they can make any necessary adjustments. If you've already placed an order and need to return it due to sizing issues, you can do so at no cost within the first 100 days through our Order Tracker page.",
            "Thanks for your feedback. I'll forward it to our size guide team for review. If you've already received your order and the size doesn't quite fit, don't worry! You can initiate a return using our Order Tracker page, and it's free of charge within the first 100 days."
        ]
    },
    "Sizing Exchanges": {
        "patterns": [
            "I bought the wrong size, how can I exchange it?",
            "My sizing is wrong, help me",
            "I bought the wrong size",
            "How do I exchange this item for a different size",
            "Can I exchange this item for the correct size?",
            "What's the process for exchanging an item due to incorrect sizing?I need to exchange my item for a different size. What should I do?",
            "Help! I ordered the wrong size. How can I get the right one?",
            "I realized I ordered the wrong size. Can I exchange it?",
            "Could you assist me with exchanging this item for the right size?What's the process for swapping this item for a different size",
            "How can I switch this item for another size?",
            "How do I replace this item with a different size?",
            "What's the procedure for exchanging this item for a different size?",
            "How can I change this item for a different size?",
            "Can you tell me how to exchange this item for a different size?",
            "How do I swap this item for another size?",
            "Can you explain how to switch this item for a different size",
            "My size is wrong, can I return it?",
            "Help, I need to return this. The size is wrong",
            "You sold me the wrong size",
            "I purchased the incorrect size"
        ],
        "responses": [
            "To exchange your item for a different size, first make sure the item is in its original condition with tags attached. Then, visit our Order Tracker to start your return process. Your return will be free within 100 days!",
            "To exchange your item for a different size, ensure it's in its original condition with tags attached. Then, go to our Order Tracker to start the return process. And don't worry, returns are free within 100 days!",
            "If you need to exchange an item for a different size, make sure it's in its original condition with tags attached. Then, simply visit our Order Tracker to begin the return process. Plus, returns are free of charge within 100 days!"
        ]
    },
    "Size Availability": {
        "patterns": [
            "Can I receive notifications when my size is back in stock?",
            "Is there an option to be alerted when my size becomes available?",
            "Can you let me know when my size is restocked?",
            "How can I get updates on the availability of my size?",
            "Is there a way to get alerts when my size is available.",
            "Is there a way to be informed when my size is restocked?",
            "Can you notify me when my size returns to stock?",
            "Is there a system for alerting me when my size is available again?",
            "How can I be notified when my size is back in stock?",
            "Is there a way to get updates when my size is available again.",
            "Tell me when my size is available",
            "How can I figure out when my size is in stock again",
            "Any way you can let me know when my size is available",
            "I would like to know when my size is in stock",
            "Inform me about the availability of my size",
            "My size is currently not available",
            "I cannot find my size",
            "My size is not in stock right now",
            "My size seems to be unavailable at the moment.",
            "I'm having trouble finding my size in stock.",
            "\"It appears that my size is not currently available.",
            "\"I cannot seem to locate my size in the available options",
            "\"Unfortunately, the size I need is not in stock right now",
            "\"I'm unable to find my size among the available choices",
            "\"It looks like my size is currently out of stock",
            "\"I've checked, but it seems my size is unavailable",
            "\"I've searched, but I can't find my size listed",
            "\"My preferred size doesn't seem to be in stock at the moment"
        ],
        "responses": [
            "We're sorry you couldn't find your sizing. But rest assured we're working to put your size back in stock as soon as possible. To get alerts when your size is back, visit the product page and click 'Notify Me' to subscribe.",
            "We apologize for the inconvenience of your size not being available at the moment. Please know that we're actively working to replenish our stock. To receive notifications when your size is back in stock, simply visit the product page and click 'Notify Me' to subscribe.",
            "We understand it's disappointing when your size isn't available. Our team is already working on restocking, and you can sign up for notifications by clicking 'Notify Me' on the product page to stay updated on when your size becomes available again."
        ]
    },
    "Sizing Assistance for Children": {
        "patterns": [
            "Can you provide me with a children's sizing chart",
            "Can you share a children's size chart with me?",
            "Is there a guide for kids' sizing available?",
            "Can I see a children's size guide?",
            "Could you point me to a sizing chart for children's apparel",
            "I need help with my kid's size",
            "I don't know my kid's size",
            "How can I figure my children's size",
            "Tell me my children's size",
            "I'm looking for assistance with determining my child's size",
            "I'm unsure about my child's size. Can you help?",
            "How can I determine my children's size accurately?",
            "Could you assist me in finding the correct size for my child?",
            "I'm not sure what size my child wears. Can you provide guidance?",
            "Where can I find information about sizing for children's clothes?",
            "Is my child a size 5 or 6",
            "Is my child a size 10 or 11",
            "I'm not sure if my kid is a size 6 or 8",
            "Help me, I can't tell if my kid is size 4 or 5",
            "What's my kid's size"
        ],
        "responses": [
            "Right on! Kids' sizing can be confusing. Hopefully, our Kids Size Chart will help you find the perfect fit for your cute little ones. Don't worry, if the sizing turns out wrong, you can always return the item for free within 100 days.",
            "I understand! Kids' sizing can be a bit tricky. Hopefully, our Kids Size Chart will provide clarity and help you find the perfect fit for your little ones. And remember, if the sizing doesn't quite work out, you can always return the item for free within 100 days.",
            "I get it! Kids' sizing can be overwhelming. Our Kids Size Chart is designed to make the process smoother for you and help you find the perfect size for your kiddos. Plus, if the size isn't quite right, you can return the item for free within 100 days."
        ]
    },
    "Account Creation": {
        "patterns": [
            "How do I create an account?",
            "What steps should I follow to set up an account?",
            "Can you guide me through the process of opening an account?",
            "What do I need to do to create a new account?",
            "Create account",
            "Register account",
            "I don't know how to create an account",
            "Register me",
            "I want to start using Adidas",
            "I want to start shopping on Adidas",
            "Open an account for me",
            "How can I open an account",
            "I want to buy some items here",
            "I'm interested in some items here",
            "Help me to register",
            "I don't have an account",
            "Can I open another account",
            "Open a different account",
            "Create a user account",
            "Create an account for my son",
            "Open an account for my daughter",
            "Tell me the steps to register",
            "I want to shop on Adidas",
            "Register",
            "I don't know how to register"
        ],
        "responses": [
            "Getting started on Adidas is easy peasy. Follow these steps to create an account and start shopping for the most premium trainers, clothes, pants, tracksuits, jackets, and gloves on the market.",
            "Getting started with Adidas is as easy as 1-2-3! Follow these straightforward instructions to create your account and dive into our premium selection of trainers, clothes, pants, tracksuits, jackets, and gloves.",
            "Ready to get started with Adidas? It's a piece of cake! Simply follow these steps to set up your account and discover our exceptional collection of trainers, clothes, pants, tracksuits, jackets, and gloves."
        ]
    },
    "Delete Account": {
        "patterns": [
            "Delete account",
            "Remove account",
            "I want to leave Adidas",
            "I want to leave this site",
            "Close my account",
            "I don't want to shop here anymore",
            "I'm leaving this site",
            "How do I delete my account?",
            "What steps do I need to take to permanently remove my account?",
            "What is the process to delete my account?",
            "How do I permanently remove my account?",
            "Can you tell me how to close my account?",
            "What do I need to do to deactivate my account?",
            "How can I delete my account completely?",
            "What's the procedure for getting rid of my account?",
            "Can you guide me on how to cancel my account?",
            "How do I go about terminating my account?",
            "What steps do I need to follow to erase my account?",
            "What are the instructions for deleting my account?",
            "What steps should I take to remove my account?",
            "Can you guide me through the process of closing my account?",
            "How can I permanently delete my account?",
            "Tell me about user account deletion",
            "I'm no longer using this account",
            "I have no use for this account",
            "I would like to remove my account",
            "I want to delete my account",
            "Cancel my account",
            "Deactivate account",
            "How can I deactivate my account",
            "Could you help me deactivate my account"
        ],
        "responses": [
            "If you want to delete your account, follow these quick, easy steps and your account will be deactivated in a matter of minutes. We're sorry to see you go, and know you're welcome back anytime :)",
            "We understand if you need to delete your account, and we're here to help. Just follow these easy steps, and your account will be deactivated shortly. Remember, the door is always open for your return!",
            "We're sorry to see you go, but if you need to delete your account, we've made it easy for you. Follow these simple steps, and your account will be deactivated in no time. And remember, you're welcome back anytime!"
        ]
    },
    "Account Login": {
        "patterns": [
            "Can I use my username or email address to log in?",
            "Is there an option to log in using my social media accounts?",
            "What should I do if I'm having trouble logging into my account?",
            "Is there a limit to the number of login attempts I can make?",
            "Do I need to verify my email address or phone number during the login process?",
            "Can I set up two-factor authentication for added security?",
            "Is my login information stored securely?",
            "Can I stay logged in on this device?",
            "What should I do if I suspect someone else has accessed my account?",
            "Is there a way to log in using a fingerprint or facial recognition?\"Can I change my username or password after logging in?",
            "Is there a timeout period for inactive login sessions?",
            "Can I log in to multiple devices simultaneously?",
            "Is there a customer support option if I encounter difficulties logging in?",
            "Log in to my account",
            "I need help signing in to my account",
            "How can I access my account",
            "I want to start shopping",
            "Sign in",
            "Go to my account",
            "Tell me how to log in to my account"
        ],
        "responses": [
            "If you already have an Adidas account, go to the Adidas homepage, click the third icon from the right, enter your email address, and log in to your account. If you prefer using face recognition or fingerprint, use the phone app. For more inquiries about login, please contact our Support Team.",
            "If you're an existing Adidas account holder, simply head to the Adidas homepage and click on the third icon from the right. Enter your email address and password to log in. If you prefer using face recognition or fingerprint, you can do so on the Adidas mobile app. For further assistance with login inquiries, feel free to reach out to our Support Team.",
            "If you're already registered with Adidas, getting into your account is simple. Head over to the Adidas homepage, click on the third icon from the right, and enter your email address and password. Alternatively, use face recognition or fingerprint on the Adidas mobile app for quick access. Need assistance with logging in? Feel free to reach out to our Support Team."
        ]
    },
    "Account Settings": {
        "patterns": [
            "Where can I find my account settings?",
            "Can you guide me on how to access my account settings.",
            "What is the process to access my account settings?",
            "Can you help me locate the account settings menu?",
            "How do I get into my account settings?",
            "Where do I go to find my account settings?",
            "Can you assist me in opening my account settings?",
            "How can I get to my account settings?",
            "What steps do I take to find my account settings?",
            "Can you show me how to open my account settings?",
            "How do I navigate to my account settings?",
            "Where can I find the option for my account settings?",
            ""
        ],
        "responses": [
            "Once in the Settings area, you can adjust your preferences, privacy settings, and other account-related information.",
            "Open the Settings area, you can then customize your preferences, privacy options, and other account details.",
            "Access the Settings section, you have the ability to tailor your preferences, manage privacy settings, and modify other aspects of your account.",
            ""
        ]
    },
    "Account Reset": {
        "patterns": [
            "I forgot my username, how can I retrieve it?",
            "What should I do if I can't remember the email address associated with my account?",
            "Can you help me reset my password?",
            "Is there a way to recover my account if I've forgotten both my username and password?",
            "Can I reset my security questions and answers for account recovery?",
            "How long does it take to receive a password reset email?",
            "What if I don't receive the password reset email?",
            "Can I reset my account on the chatbot, or do I need to visit the website?",
            "Is there a limit to how many times I can reset my password?",
            "Do I need to verify my identity before resetting my account?",
            "Can I reset my account if it's been locked due to too many failed login attempts?",
            "Can I reset my account if it's been compromised or hacked?",
            "What information do I need to provide to reset my account?",
            "Reset my account",
            "I've forgotten my password",
            "Remind me my password",
            "Change my password",
            "Change my email address",
            "I've forgotten my email address",
            "Modify my email address",
            "Remind me my email address",
            "Change my phone number",
            "I've forgotten my phone number",
            "Modify my phone number",
            "Remind me my phone number",
            "Retrieve me password",
            "Tell me how to change my password",
            "Why can't I change my email address"
        ],
        "responses": [
            "To reset your Adidas account, simply follow the step-by-step guide provided on this page. Remember to store your account details securely to avoid forgetting them in the future.",
            "If you need to reset your Adidas account, don't worry—it's simple! Just follow the detailed instructions on this page, and you'll be back on track. And don't forget to save your account details securely.\"You can easily reset your Adidas account following the step-by-step guide on this page. Ensure you save your account details in a safe location so you don't forget next time.",
            ""
        ]
    },
    "AdiClub Membership": {
        "patterns": [
            "Tell me about AdiClub",
            "What is AdiClub",
            "Let me know everything about AdiClub",
            "I want to join AdiClub",
            "How do I register for AdiClub",
            "I want to become an Adidas member",
            "Show me the steps to become a member",
            "Tell me about your loyalty program",
            "How does your loyalty program work?",
            "What are the benefits of joining your loyalty program?",
            "Is there a cost or fee to join the loyalty program?",
            "How do I sign up for the loyalty program?",
            "Do I earn points for every purchase, and if so, how many?",
            "Can I earn rewards for other actions besides purchases?",
            "Are there different tiers or levels in the loyalty program?",
            "What perks do I get at each tier of the VIP program?",
            "How do I redeem the rewards I've earned?",
            "Is there an expiration date for my loyalty points or rewards?",
            "Can I transfer my loyalty points to someone else?",
            "Are there any restrictions on what I can use my rewards for?",
            "Do you offer bonus points or rewards for certain activities or events?",
            "Can I track my loyalty points and rewards online?",
            ""
        ],
        "responses": [
            "AdiClub is our special loyalty program for our valued customers. For any information regarding the exclusive AdiClub, visit our dedicated page.AdiClub is our way of showing appreciation to our loyal customers. To learn more about the perks and rewards of being an AdiClub member, check out our dedicated page.AdiClub is our special loyalty program designed to thank our loyal customers for their support. For detailed information about AdiClub and its exclusive perks, visit our dedicated page."
        ]
    },
    "New Customer Discounts": {
        "patterns": [
            "Are there any discount codes for new customers?",
            "Do you offer promotions for first-time buyers?",
            "Is there a special deal for new customers.",
            "Do you offer any discount codes for new customers?",
            "How can I receive a discount as a new customer?",
            "Is there a special promotion for first-time customers?",
            "Where can I find new customer discount codes?",
            "What is the discount rate for new customers?",
            "How do I apply the new customer discount code at checkout?",
            "Do you offer any special promotions for new customers?",
            "Is there a new customer discount code available?",
            "Are there any special deals for first-time buyers?",
            "Do you have any offers specifically for new customers?",
            "What discounts are available for new customers?",
            "Can you provide me with any new customer promos?",
            "Is there a welcome discount for first-time customers?",
            "Do you have any special rates for new customers?",
            "Are there any incentives for first-time buyers?",
            "Do you offer any first-time customer discount codes?",
            ""
        ],
        "responses": [
            "As a new customer, you're in for a treat! We offer a range of promotions exclusively for newcomers, including discounts, free deliveries, buy-one-get-one-free deals, and more. Be sure to check out the terms and conditions for all our offers.",
            "New to the club? You're in luck! We have an array of promotions tailored specifically for new customers, including discounts, free deliveries, buy-one-get-one-free offers, and much more. Take a moment to review the terms and conditions for each offer.",
            "Hey there, new customer! We're thrilled to have you join us. To make your experience even better, we're offering a variety of promotions, including discounts, free deliveries, buy one get one free deals, and more. Make sure to check out the terms and conditions of our offers before you shop."
        ]
    },
    "Discounts": {
        "patterns": [
            "Discount code",
            "I need discounts",
            "I want discount",
            "I need coupons",
            "Give me bonus codes",
            "I want a discount on my purchases",
            "How can I get a discount on my orders",
            "I would like a discount on my purchase",
            "Can I get free deals on my purchase",
            "I need a discount code",
            "Is there a discount code",
            "Do you offer a bonus code",
            "I need a bonus code",
            "Give me a discount",
            "I need a voucher",
            "Do you offer any discount codes?",
            "How can I receive a discount",
            "Are there any coupon codes available for my purchase?",
            "Where can I find discount codes?",
            "What is the discount rate?",
            "Do I need to sign up for a newsletter or create an account to receive a discount?",
            "Discount code is not working",
            "What special offers do you currently have available?",
            "Are there any discounts or promotions?",
            "Do you offer special deals for loyal customers?",
            "Can you tell me about any limited-time offers or flash sales?",
            "Are there any promotions for specific product categories?",
            "Do you have any buy-one-get-one (BOGO) deals?",
            "Are there any exclusive offers for newsletter subscribers?",
            "Do you offer discounts for referring friends or family?",
            "Can I receive a discount for leaving a product review?",
            "Are there any bundle deals or package discounts?",
            "Do you offer special discounts for students, seniors, or military personnel?",
            "Are there any seasonal promotions or holiday sales?",
            "Can I get a discount for purchasing a certain quantity of items?",
            "Do you have any clearance or markdown items?",
            "Are there any upcoming special events or promotions I should know about?",
            ""
        ],
        "responses": [
            "Looking for a discount? You're in luck! We offer various promotions and discounts from time to time. Keep an eye on our website or sign up for our newsletter to stay updated on our latest offers. Note that if you join AdiClub today, you get 10% off all purchases.",
            "Want to save some money? We regularly roll out promotions and discounts that you won't want to miss. Keep tabs on our website or subscribe to our newsletter for the latest updates. And here's a bonus: Sign up for AdiClub today and receive a 10% discount on all your purchases.",
            "Looking to save some cash? You're in luck! We frequently have promotions and discounts available. Stay updated by checking our website or subscribing to our newsletter. And here's something special: Join AdiClub today and receive a 10% discount on all your purchases."
        ]
    },
    "Sales": {
        "patterns": [
            "Are there any ongoing sales or promotions?",
            "Can you tell me about any upcoming sales events?",
            "Do you offer seasonal or holiday sales?",
            "Do you have a clearance section with discounted items?",
            "Are there any special sales for loyalty program members?",
            "Are there any ongoing sales?",
            "What items are currently on sale?",
            "Do you have any promotions happening now.",
            "Do you have any active sales right now?",
            "Are there sales happening at the moment?",
            "Is there a sale currently going on?",
            "Are there any promotions taking place now?",
            "Is there anything on sale at the moment.",
            ""
        ],
        "responses": [
            "We currently have ongoing sales and promotions available. Check out our website or subscribe to our newsletter to stay updated on the latest deals.",
            "We frequently offer discounts and sales on specific product categories. Keep an eye on our website or subscribe to our newsletter to stay informed about these special offers.",
            "We occasionally offer special sales for our AdiClub members. Keep an eye on your inbox or our website for exclusive member sales."
        ]
    },
    "Website Issues": {
        "patterns": [
            "Why is the website not loading properly?",
            "Some pages on the website are showing errors. What should I do?",
            "Why am I experiencing slow loading times on the website?",
            "I'm unable to add items to my cart. Is there a problem with the website?",
            "Can you assist with an error message I'm seeing on the checkout page?",
            "Why can't I access certain features or sections of the website?",
            "Is the website down for maintenance or experiencing technical issues?",
            "I'm encountering broken links on the website. Can you fix them?",
            "How can I report a bug or technical issue I've encountered on the website?",
            "Are there any known issues with the website's compatibility with certain browsers?",
            "Why am I being redirected to an error page when trying to complete my purchase?",
            "I'm seeing outdated information on the website. How can I get it updated?",
            "Is there a way to clear my browser cache to resolve website issues?",
            "Website is not responding at the moment",
            "Looks like the website is down",
            "Website is unresponsive",
            "Some links are not opening",
            "Help me navigate the website. Seems there's a problem",
            "An error shows up when I try to checkout",
            "Error message when I want to log in",
            "Website is always shutting down",
            "Troubleshoot an issue on this website",
            ""
        ],
        "responses": [
            "If your Adidas website is not running properly, try logging out, closing the site, and logging back in again. In case that doesn't fix it, you may try restarting your phone or computer. If the problem persists, contact one of our customer care representatives for assistance.",
            "If you're experiencing issues with the Adidas website, try logging out, closing the site, and logging back in. If the problem persists, consider restarting your device. If you still encounter difficulties, feel free to reach out to our customer care team for further assistance.",
            "Having trouble with the Adidas website? First, try logging out and then back in. If that doesn't resolve the issue, try refreshing the page or clearing your browser's cache. If the problem persists, don't hesitate to contact our customer support team for help."
        ]
    },
    "App Issues": {
        "patterns": [
            "Why is the app crashing when I try to open it?",
            "I'm experiencing slow performance on the app. Can you help?",
            "Some features of the app aren't working as expected. What should I do?",
            "I'm having trouble logging into my account on the app. Can you assist?",
            "Why am I unable to complete a purchase through the app?",
            "Is there a problem with the app's compatibility with my device?",
            "I received an error message while using the app. What does it mean?",
            "Are there any known issues with the latest version of the app?",
            "How can I report a bug or technical issue I've encountered in the app?",
            "Why am I not receiving notifications from the app?",
            "Can you help me troubleshoot an issue with my app settings?",
            "Is there a way to update the app to fix bugs or improve performance?",
            "Why is the app freezing or lagging during use?",
            "I'm encountering issues with in-app purchases. What should I do?",
            "Can you provide assistance with syncing data between the app and my account?",
            ""
        ],
        "responses": [
            "We apologize for the inconvenience caused by the slow performance of the app. This could be due to a temporary server issue or insufficient device storage. We recommend closing any unnecessary apps running in the background and ensuring your device has enough storage space. If the problem persists, please reach out to our support team for further assistance.",
            "We're sorry to hear that you're encountering issues with some features of the app. This could be due to a bug or software issue. We recommend checking for app updates in the app store, as well as clearing the app cache and data. If the problem persists, please contact our support team for further assistance."
        ]
    },
    "Complaint": {
        "patterns": [
            "I need to file a complaint",
            "I want assistance to make a consumer claim",
            "i dont know how to file a customer reclamation",
            "could you help me filing a complaint against your business?",
            "i do not know how to file a customer reclamation",
            "can you help me file a customer claim?",
            "how to file a consumer claim?",
            "want help making a consumer reclamation against your business",
            "can you help me file a complaint?",
            "I do not know how to file a complaint",
            "assistance filing a customer claim against your company",
            "help to file a customer claim against ur business",
            "I'm not happy with ur work i wanna lodge a customer claim",
            "i try to file a complaint against ur organization",
            "I would like to file a complaint",
            "I need help filing a complaint",
            "where can I file a consumer complaint against your business?",
            "can you help me to complain about your business?",
            "I am trying to make a customer complaint against your company",
            "is it possible to file a consumer claim",
            "help making a consumer complaint against your company",
            "how could I file a complaint against your business?",
            "filing consumer reclamation against your company",
            "where do I file a complaint?",
            "help filing a complaint against your business",
            "i try to file a consumer reclamation against ur company",
            "I need help to file a complaint against your business",
            "where to file a consumer claim?",
            "help to file a customer claim against your organization",
            "how to lodge a customer claim",
            "what do I have to do to file a complaint?",
            "how do i make a customer claim against ur business?",
            "what do I need to do to file a complaint?",
            "I need help to lodge a bloody complaint against your company",
            "I am trying to file a complaint against your business",
            "how can I file a complaint against your business?",
            "how do I file a complaint against your business?",
            "I am calling to file a complaint",
            "I need assistance to file a complaint",
            "I'm not happy with ur work, help me to lodge a complaint",
            "I don't know what I have to do to file a complaint",
            "can ya help me to make a consumer complaint?"
        ],
        "responses": [
            "Sorry to hear you want to complain. You can submit a complaint here or feel free to contact our team on +44 20 7365 7315 and a team member will be able to help.",
            "We apologize for any inconvenience you've encountered. If you'd like to file a complaint, you can do so by submitting a form online. Alternatively, feel free to contact our team at +44 20 7365 7315, and we'll be more than happy to assist you further.",
            "We're sorry that you're dissatisfied with your experience. Your feedback is important to us. You can submit a complaint through our online form, or you can contact our team directly at +44 20 7365 7315 for immediate assistance."
        ]
    },
    "Product Availability": {
        "patterns": [
            "Are trainers available in stock",
            "When will jackets be back in stock",
            "Are there any plans to restock",
            "Are trainers available",
            "Is the product I'm looking for currently available",
            "Can you check if the item I want is in stock",
            "Do you have any products available for purchase",
            "When can I expect products to be restocked",
            "Are there any items available for online purchase",
            "How can I find out about the availability of items",
            "Is it possible to know if products will be available soon",
            "Can you provide details about product availability",
            "Are products typically restocked regularly",
            "Where can I find information on product availability",
            "How do I know if this product is available",
            "Is this product in stock",
            "Do you have this product",
            "Can I find this product here",
            "What is available",
            "What is in stock",
            "Are the items I'm interested in currently in stock?",
            "Can you verify the availability of the items I want?",
            "Do you have any products ready for purchase?",
            "When can I anticipate a restock of the items?",
            "Are there any products available for online order?",
            "How can I stay informed about product availability?",
            "Is there an estimate for when the products will be restocked?",
            "Could you provide information on the availability of items?",
            "Are products usually replenished on a regular basis?",
            "Where should I look to find updates on product availability?"
        ],
        "responses": [
            "You can easily check for the availability of products on our website, either through the navigation menu or the search menu. Learn more about how to find the Adidas products you're looking for",
            "Finding product availability on our website is simple. Whether you use the navigation menu or the search function, you'll be able to locate Adidas products with ease. Find out more about navigating our website effectively.",
            "Exploring product availability on our website is user-friendly. Use the navigation menu or the search bar to discover Adidas products effortlessly. Find more information on how to navigate our website efficiently."
        ]
    },
    "Browser Compatibility": {
        "patterns": [
            "Is the Adidas website compatible with all web browsers?",
            "Which browsers does Adidas support?",
            "Do I need a specific browser to access Adidas' website?",
            "Does Adidas support Google Chrome?",
            "Is Adidas compatible with Firefox?",
            "Can I use Safari to browse Adidas' website?",
            "How well does Adidas work with Microsoft Edge?",
            "Is the Adidas website optimized for mobile browsers?",
            "Can I access Adidas' site from my smartphone browser?",
            "Which mobile browsers does Adidas recommend?",
            "Does Adidas support older versions of web browsers?",
            "Will Adidas work with the latest version of my browser?",
            "Is there a minimum browser version required to use Adidas' website?",
            "I'm experiencing issues accessing Adidas' site on my browser, what should I do?",
            "My browser doesn't seem to display Adidas' site correctly, any suggestions?",
            "Are there any known compatibility issues with certain browser versions?",
            "My default browser isn't working well with Adidas, can I use a different one?",
            "Are there any recommended browsers if I'm having trouble with my current one?",
            "Can I use Mozilla Firefox for Adidas?",
            "Will Safari work with Adidas?",
            "What's the best browser for Adidas?",
            "What's the most compatible browser for Adidas website?",
            ""
        ],
        "responses": [
            "The Adidas website ensures compatibility with all major browsers, including Google Chrome, Mozilla Firefox, Microsoft Edge, and Safari. However, if you're experiencing issues, try clearing your browser cache or using a different browser for the best experience.",
            "At Adidas, we're committed to ensuring seamless browsing across popular browsers like Google Chrome, Mozilla Firefox, Microsoft Edge, and Safari. Should you encounter any challenges, we recommend clearing your browser cache or trying an alternate browser for smoother navigation.",
            "The Adidas website is designed with compatibility in mind for major browsers, including Google Chrome, Mozilla Firefox, Microsoft Edge, and Safari. If you encounter any issues, we suggest clearing your browser cache or exploring alternative browsers for optimal performance."
        ]
    },
    "Store Finder": {
        "patterns": [
            "Adidas near me",
            "Adidas store near me",
            "Buy from Adidas store near me",
            "How can I find the nearest Adidas store",
            "Does Adidas have a store locator feature",
            "Can you help me locate an Adidas store near me",
            "Where is the closest Adidas store to Southampton",
            "Can you find Adidas stores in Southampton",
            "Is there an Adidas store nearby",
            "What are the operating hours of the Adidas store nearest to me",
            "Contact information for the Adidas store in Southampton",
            "Contact information for Adidas store",
            "Contact information for Adidas store nearby",
            "Can I use the store finder to locate Adidas online retailers?Is there a way to find Adidas store locations that offer online order pickup?Are there any Adidas stores that offer exclusive in-store promotions for online purchases?Where is the nearest Adidas store to Southampton?",
            "Can you help me find an Adidas store in London?",
            "Is there an Adidas outlet near London",
            "How do I locate Adidas stores in my area",
            "Where can I find a list of Adidas retail locations",
            "I'm looking for an Adidas store in Southampton",
            "Is there a store finder feature on the Adidas website",
            "Can I purchase Adidas products from authorized retailers",
            "Do you have a map of Adidas store locations",
            "Are there any Adidas flagship stores near me",
            "Where are Adidas store locations",
            "Adidas locations",
            "Adidas store locations",
            "I'm looking for Adidas store locations",
            "Where are Adidas locations",
            "Where are Adidas stores",
            "Adidas stores",
            "I'm looking for Adidas stores"
        ],
        "responses": [
            "Looking for an Adidas outlet near you? Our store locator tool on the Adidas website can help! Simply enter your location, and discover nearby outlet stores",
            "Finding an Adidas store near you is easy with our online store locator tool. Simply enter your location details, and you'll quickly discover nearby stores waiting to serve you.",
            "In search of an Adidas outlet nearby? Our website's store locator is your best friend. Enter your location, and we'll guide you to the closest outlet store, where fantastic deals await."
        ]
    },
    "Store Hours": {
        "patterns": [
            "What are the opening hours for Adidas stores",
            "When does my nearest Adidas store open and close",
            "Can you provide the operating hours for Adidas retail locations",
            "What are the store hours for the Adidas store in Southampton",
            "Are Adidas stores open on holidays",
            "Do Adidas stores have different hours during holiday season",
            "What are the weekend hours for Adidas stores",
            "Are Adidas stores open on Saturdays and Sundays",
            "Do Adidas stores have different hours on weekends compared to weekdays",
            "Do Adidas stores have extended hours during sales events",
            "Are there any special events or promotions with extended store hours coming up",
            "Can I expect Adidas stores to have different hours during special occasions or promotions",
            "How can I find out the hours for my nearest Adidas store",
            "Is there a phone number or website where I can check store hours",
            "Where can I find information about Adidas store hours online",
            "Adidas open hours",
            "Adidas working hours",
            "When does Adidas open and close",
            "What time does Adidas close",
            "Open and close times Adidas",
            "When does the Adidas outlet close today",
            "What time does the Adidas store open tomorrow",
            "Can you provide the operating hours for the Adidas flagship store",
            "I'd like to know the store hours for the Adidas store near me.",
            "Are there any changes to Adidas store hours during holidays",
            "Do Adidas stores have different opening hours on weekends",
            "Could you tell me the closing time for the Adidas store",
            "Are Adidas stores open late on Thursdays",
            "How early does the Adidas store open on weekdays?"
        ],
        "responses": [
            "Our opening and closing times may vary depending on the specific store location and city. However, as a general guideline, Adidas stores typically operate from 9 am to 8 pm. For personalized information about store hours, please feel free to give us a call at 020 7365 7315. Our dedicated team will be happy to assist you with any inquiries regarding store hours at your preferred Adidas location.",
            "While our store hours may differ depending on the city and location, Adidas stores generally open at 9 am and close at 6 pm. For precise details tailored to your preferred store, don't hesitate to reach out to us at 020 7365 7315. Our team is standing by to provide personalized assistance regarding store hours.",
            "Adidas store hours can vary based on the specific store and its location. As a rule of thumb, our stores typically open at 9 am and close at 6 pm. However, for accurate and customized information about store hours, please contact us directly at 020 7365 7315. We're here to ensure you have all the details you need for your next shopping trip."
        ]
    },
    "Limited Edition Releases": {
        "patterns": [
            "When is the next limited edition release from Adidas?",
            "Can you provide information about the latest limited edition sneakers from Adidas?",
            "Are there any upcoming exclusive releases from Adidas?",
            "How can I stay informed about Adidas limited edition drops?",
            "Do you have any information about the recent limited edition collaborations?",
            "Where can I find details about past limited edition releases?",
            "Are there any exclusive collections launching soon?",
            "Can you notify me when Adidas releases new limited edition products?",
            "Do Adidas stores offer early access to limited edition releases?",
            "What's the process for purchasing limited edition items from Adidas?",
            "I want limited edition",
            "Do you have limited edition"
        ],
        "responses": [
            "Adidas frequently announces limited edition releases on our dedicated page and social media channels. Keep an eye out for updates to stay informed about the next exciting drop!",
            "You can stay updated on our latest limited edition releases by visiting our website and exploring our dedicated page for exclusive drops. Additionally, be sure to follow us on social media to catch sneak peeks and announcements about upcoming releases. Don't miss out on the excitement!"
        ]
    },
    "Pre-orders": {
        "patterns": [
            "How does the preorder process work for Adidas products?",
            "Can I preorder upcoming Adidas releases?",
            "Are there any benefits to preordering Adidas products?",
            "What products are currently available for preorder from Adidas?",
            "How can I find out about upcoming products available for preorder?",
            "Are there any limited-edition items available for preorder?",
            "How do I place a preorder for an Adidas product?",
            "What information do I need to provide to complete a preorder?",
            "Is there a deposit required for preordering Adidas products?",
            "Can I check the status of my preorder?",
            "Will I receive updates on my preorder status?",
            "How will I know when my preorder is ready for shipment or pickup?",
            "When will I be charged for my preorder?",
            "Can I cancel or modify my preorder?",
            "How long does it take for a preorder to be delivered?",
            "Can I choose a specific delivery date for my preorder?",
            "Is there an option for in-store pickup for preordered items?",
            "Can I preorder",
            "How do I preorder",
            "Do you have preorders",
            "Give me info on preorders",
            "How can I preorder from Adidas",
            "Is Yeezys available for preorder",
            "When will preorders start?",
            "Can I reserve a product before it's released",
            "What is the preorder process for Adidas products",
            "Do I need to pay upfront for a preorder",
            "Are there any benefits to preordering?",
            "Can I cancel a preorder if I change my mind",
            "What happens if the release date for a preorder is delayed",
            "How long will it take for my preorder to ship after release"
        ],
        "responses": [
            "Exciting news! Preorders are currently live on Adidas. Head over to our preorder page for details on how to secure your favorite products before they're released.",
            "Preorders are available on Adidas. For all information about preorders and reserving a product, check this page.",
            "Preorders are now open at Adidas! For everything you need to know about reserving a product in advance, visit our dedicated preorder page."
        ]
    },
    "Product Warranties": {
        "patterns": [
            "What type of warranty does Adidas offer on its products",
            "Are Adidas products covered by a warranty",
            "How long is the warranty period for Adidas products",
            "What does the Adidas product warranty cover",
            "Are there any specific conditions or limitations to the Adidas product warranty",
            "Does the warranty cover defects or damages",
            "How do I make a warranty claim for an Adidas product",
            "What information do I need to provide when making a warranty claim",
            "Is there a specific process for returning or exchanging a product under warranty",
            "How long does the Adidas product warranty last",
            "Is there a difference in warranty duration for different types of Adidas products",
            "Does the warranty period start from the date of purchase or delivery",
            "Does Adidas offer a warranty on footwear",
            "Is there a separate warranty for Adidas apparel",
            "What about accessories like bags or hats? Are they covered by the warranty",
            "Does Adidas offer any extended warranty options",
            "Can I purchase additional warranty coverage for my Adidas products",
            "What are the benefits of extending the warranty on my Adidas products",
            "Do you have warranty",
            "Tell me about your warranty",
            "Check warranty",
            "Verify warranty",
            "Confirm warranty",
            "How do I submit a warranty claim for my Adidas product",
            "What is the process for filing a warranty claim with Adidas",
            "Can you guide me through the steps to make a warranty claim",
            "What information do I need to provide when filing a warranty claim",
            "Do I need to provide proof of purchase when making a warranty claim",
            "Are there any specific details or documentation required for the warranty claim process",
            "How can I check the status of my warranty claim",
            "Will I receive updates on the progress of my warranty claim",
            "Is there a way to track my warranty claim online",
            "How long does it take for Adidas to process a warranty claim",
            "What is the expected timeframe for resolving a warranty claim",
            "Can I expect a timely response to my warranty claim",
            "How long is the warranty period for Adidas products?",
            "What is the duration of the warranty offered by Adidas?",
            "Can you tell me how long the warranty lasts for Adidas products?",
            "What is the warranty duration for Adidas footwear?",
            "Is there a different warranty period for Adidas apparel?",
            "How long is the warranty for Adidas accessories like bags or hats?",
            "Does the warranty period start from the date of purchase?",
            "When does the warranty coverage begin for Adidas products?",
            "Is the warranty duration calculated from the date of delivery?",
            "Can I extend the warranty for my Adidas product?",
            "Is there an option to renew the warranty after it expires?",
            "Are there any additional warranty coverage options available?",
            "Can I transfer the remaining warranty to someone else if I sell my Adidas product?",
            "Is the warranty transferable to a new owner if I gift my Adidas product to someone else?",
            "What are the conditions for transferring the warranty to another person?",
            "Does the warranty cover Adidas products purchased internationally?",
            "Will the warranty be valid if I use my Adidas product outside the country of purchase?",
            "How does warranty coverage work for Adidas products bought abroad?",
            ""
        ],
        "responses": [
            "Adidas offers a limited warranty on its products to ensure customer satisfaction and quality assurance. Click here to learn everything about our warranty policies and procedures.",
            "Adidas offers a limited warranty as part of our commitment to product quality and customer satisfaction. You can find detailed information about our warranty policies and procedures here.",
            "Adidas provides a limited warranty on its products to ensure quality and customer satisfaction. If you're interested in learning about our warranty policies and procedures, you can find more information here."
        ]
    },
    "Customer Support Feedback": {
        "patterns": [
            "How can I provide feedback on the Adidas customer support experience?",
            "Is there a way to share my thoughts or suggestions regarding Adidas customer support?",
            "Does Adidas welcome feedback from customers about its customer support services?",
            "I'd like to provide feedback about my recent interaction with Adidas customer support. How can I do that?",
            "Can I share my thoughts or suggestions about the responsiveness or helpfulness of Adidas customer support representatives?",
            "Where can I submit feedback about the resolution process for my Adidas inquiry or complaint?",
            "What is the process for submitting customer support feedback to Adidas?",
            "Is there a form or platform where I can submit my feedback about Adidas customer support?",
            "How can I ensure that my feedback reaches the appropriate team at Adidas?",
            "Will my feedback about Adidas customer support be considered by the company?",
            "Can I expect a response from Adidas after submitting customer support feedback?",
            "Can I suggest improvements or new initiatives for Adidas customer support?"
        ],
        "responses": [
            "Adidas values your feedback on its customer support services. You can share your thoughts or suggestions by contacting Adidas customer support directly through our website or by participating in customer surveys sent out by the company.",
            "Adidas welcomes feedback from customers about its customer support services. You can provide feedback on your recent interaction by contacting Adidas customer support directly or by participating in surveys."
        ]
    },
    "Contact Information": {
        "patterns": [
            "How can I contact Adidas customer support?",
            "What are the ways to reach out to Adidas customer support?",
            "How do I get in touch with Adidas customer service?",
            "What's the best method to contact Adidas for support?",
            "How do I contact Adidas for assistance?",
            "Where can I find the contact information for Adidas customer support?",
            "What's the way to connect with Adidas customer service?",
            "Can you tell me how to contact Adidas for help?",
            "What are the contact options for Adidas customer support?",
            "How can I reach Adidas's customer support team?",
            "What are the methods for contacting Adidas's support team?",
            "How do I speak to an Adidas customer support representative?",
            "How do I communicate with Adidas customer service?",
            "What's the contact information for Adidas customer service?",
            "How can I reach Adidas for customer assistance?",
            "How can I find contact details for Adidas support?"
        ],
        "responses": [
            "You have multiple options to get in touch with Adidas Help. Feel free to reach out to us via phone or WhatsApp at 020 7365 7315. Alternatively, you can connect with us via live chat or official social media channels including Twitter, Instagram, Facebook, and TikTok.",
            "Getting assistance from Adidas Help is easy! You can contact us by phone or WhatsApp at 020 7365 7315. Alternatively, you can utilize our live chat feature on the website or connect with us through our verified social media channels on Twitter, Instagram, Facebook, and TikTok.",
            "At Adidas Help, we're here to assist you. You can get in touch with us by phone or WhatsApp at 020 7365 7315. If you prefer, you can also engage in live chat support or connect with us via our official social media channels, including Twitter, Instagram, Facebook, and TikTok."
        ]
    },
    "null": {
        "patterns": [],
        "responses": []
    }
}